#![allow(non_snake_case)]
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]

/* automatically generated by rust-bindgen 0.60.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const NVVIOBUFFERFORMAT_R16FPG16FPB16FPZ24: u32 = 32;
pub const NVVIOBUFFERFORMAT_R16FPG16FPB16FPA16FP: u32 = 64;
pub const NVVIOBUFFERFORMAT_R16FPG16FPB16FPA16FPZ24: u32 = 128;
pub const MAX_NUM_COMPOSITE_RANGE: u32 = 2;
pub const NVVIOCONFIG_SIGNALFORMAT: u32 = 1;
pub const NVVIOCONFIG_DATAFORMAT: u32 = 2;
pub const NVVIOCONFIG_OUTPUTREGION: u32 = 4;
pub const NVVIOCONFIG_OUTPUTAREA: u32 = 8;
pub const NVVIOCONFIG_COLORCONVERSION: u32 = 16;
pub const NVVIOCONFIG_GAMMACORRECTION: u32 = 32;
pub const NVVIOCONFIG_SYNCSOURCEENABLE: u32 = 64;
pub const NVVIOCONFIG_SYNCDELAY: u32 = 128;
pub const NVVIOCONFIG_COMPOSITESYNCTYPE: u32 = 256;
pub const NVVIOCONFIG_FRAMELOCKENABLE: u32 = 512;
pub const NVVIOCONFIG_422FILTER: u32 = 1024;
pub const NVVIOCONFIG_COMPOSITETERMINATE: u32 = 2048;
pub const NVVIOCONFIG_DATAINTEGRITYCHECK: u32 = 4096;
pub const NVVIOCONFIG_CSCOVERRIDE: u32 = 8192;
pub const NVVIOCONFIG_FLIPQUEUELENGTH: u32 = 16384;
pub const NVVIOCONFIG_ANCTIMECODEGENERATION: u32 = 32768;
pub const NVVIOCONFIG_COMPOSITE: u32 = 65536;
pub const NVVIOCONFIG_ALPHAKEYCOMPOSITE: u32 = 131072;
pub const NVVIOCONFIG_COMPOSITE_Y: u32 = 262144;
pub const NVVIOCONFIG_COMPOSITE_CR: u32 = 524288;
pub const NVVIOCONFIG_COMPOSITE_CB: u32 = 1048576;
pub const NVVIOCONFIG_FULL_COLOR_RANGE: u32 = 2097152;
pub const NVVIOCONFIG_RGB_DATA: u32 = 4194304;
pub const NVVIOCONFIG_RESERVED_SDIOUTPUTENABLE: u32 = 8388608;
pub const NVVIOCONFIG_STREAMS: u32 = 16777216;
pub const NVVIOCONFIG_ANC_PARITY_COMPUTATION: u32 = 33554432;
pub const NVVIOCONFIG_ANC_AUDIO_REPEAT: u32 = 67108864;
pub const NVVIOCONFIG_ALLFIELDS: u32 = 134217727;
pub const NVVIOCONFIG_VALIDFIELDS: u32 = 134217727;
pub const NVVIOCONFIG_DRIVERFIELDS: u32 = 16412;
pub const NVVIOCONFIG_GAMMAFIELDS: u32 = 32;
pub const NVVIOCONFIG_RMCTRLFIELDS: u32 = 2039619;
pub const NVVIOCONFIG_RMSKEWFIELDS: u32 = 128;
pub const NVVIOCONFIG_ALLOWSDIRUNNING_FIELDS: u32 = 35631232;
pub const NVVIOCONFIG_RMMODESET_FIELDS: u32 = 67109699;
pub const NVAPI_STEREO_QUADBUFFERED_API_VERSION: u32 = 2;
pub const NVAPI_SETTING_MAX_VALUES: u32 = 100;
pub const NV_GPU_CLIENT_UTIL_DOMAINS_MAX_V1: u32 = 4;
pub type size_t = ::std::os::raw::c_ulonglong;
pub type wchar_t = ::std::os::raw::c_ushort;
pub type max_align_t = f64;
pub type NvU64 = ::std::os::raw::c_ulonglong;
pub type NvS64 = ::std::os::raw::c_longlong;
pub type NvS32 = ::std::os::raw::c_int;
pub type NvU32 = ::std::os::raw::c_ulong;
pub type temp_NvU32 = ::std::os::raw::c_ulong;
pub type NvS16 = ::std::os::raw::c_short;
pub type NvU16 = ::std::os::raw::c_ushort;
pub type NvU8 = ::std::os::raw::c_uchar;
pub type NvS8 = ::std::os::raw::c_schar;
pub type NvF32 = f32;
pub type NvBool = NvU8;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _NV_RECT {
    pub left: NvU32,
    pub top: NvU32,
    pub right: NvU32,
    pub bottom: NvU32,
}
#[test]
fn bindgen_test_layout__NV_RECT() {
    assert_eq!(
        ::std::mem::size_of::<_NV_RECT>(),
        16usize,
        concat!("Size of: ", stringify!(_NV_RECT))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_RECT>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_RECT))
    );
    fn test_field_left() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_RECT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_RECT),
                "::",
                stringify!(left)
            )
        );
    }
    test_field_left();
    fn test_field_top() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_RECT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).top) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_RECT),
                "::",
                stringify!(top)
            )
        );
    }
    test_field_top();
    fn test_field_right() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_RECT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_RECT),
                "::",
                stringify!(right)
            )
        );
    }
    test_field_right();
    fn test_field_bottom() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_RECT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bottom) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_RECT),
                "::",
                stringify!(bottom)
            )
        );
    }
    test_field_bottom();
}
pub type NV_RECT = _NV_RECT;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvLogicalGpuHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvLogicalGpuHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvLogicalGpuHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvLogicalGpuHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvLogicalGpuHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvLogicalGpuHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvLogicalGpuHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvLogicalGpuHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvLogicalGpuHandle = *mut NvLogicalGpuHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvPhysicalGpuHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvPhysicalGpuHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvPhysicalGpuHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvPhysicalGpuHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvPhysicalGpuHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvPhysicalGpuHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvPhysicalGpuHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvPhysicalGpuHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvPhysicalGpuHandle = *mut NvPhysicalGpuHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvDisplayHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvDisplayHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvDisplayHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvDisplayHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvDisplayHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvDisplayHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvDisplayHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvDisplayHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvDisplayHandle = *mut NvDisplayHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvMonitorHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvMonitorHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvMonitorHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvMonitorHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvMonitorHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvMonitorHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvMonitorHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvMonitorHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvMonitorHandle = *mut NvMonitorHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvUnAttachedDisplayHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvUnAttachedDisplayHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvUnAttachedDisplayHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvUnAttachedDisplayHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvUnAttachedDisplayHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvUnAttachedDisplayHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvUnAttachedDisplayHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvUnAttachedDisplayHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvUnAttachedDisplayHandle = *mut NvUnAttachedDisplayHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvVisualComputingDeviceHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvVisualComputingDeviceHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvVisualComputingDeviceHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvVisualComputingDeviceHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvVisualComputingDeviceHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvVisualComputingDeviceHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvVisualComputingDeviceHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvVisualComputingDeviceHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvVisualComputingDeviceHandle = *mut NvVisualComputingDeviceHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvEventHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvEventHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvEventHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvEventHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvEventHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvEventHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvEventHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvEventHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvEventHandle = *mut NvEventHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvHICHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvHICHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvHICHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvHICHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvHICHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvHICHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvHICHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvHICHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvHICHandle = *mut NvHICHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvGSyncDeviceHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvGSyncDeviceHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvGSyncDeviceHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvGSyncDeviceHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvGSyncDeviceHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvGSyncDeviceHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvGSyncDeviceHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvGSyncDeviceHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvGSyncDeviceHandle = *mut NvGSyncDeviceHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvVioHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvVioHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvVioHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvVioHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvVioHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvVioHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvVioHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvVioHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvVioHandle = *mut NvVioHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvTransitionHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvTransitionHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvTransitionHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvTransitionHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvTransitionHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvTransitionHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvTransitionHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvTransitionHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvTransitionHandle = *mut NvTransitionHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvAudioHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvAudioHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvAudioHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvAudioHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvAudioHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvAudioHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvAudioHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvAudioHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvAudioHandle = *mut NvAudioHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct Nv3DVPContextHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Nv3DVPContextHandle__() {
    assert_eq!(
        ::std::mem::size_of::<Nv3DVPContextHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(Nv3DVPContextHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<Nv3DVPContextHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(Nv3DVPContextHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Nv3DVPContextHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Nv3DVPContextHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type Nv3DVPContextHandle = *mut Nv3DVPContextHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct Nv3DVPTransceiverHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Nv3DVPTransceiverHandle__() {
    assert_eq!(
        ::std::mem::size_of::<Nv3DVPTransceiverHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(Nv3DVPTransceiverHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<Nv3DVPTransceiverHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(Nv3DVPTransceiverHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Nv3DVPTransceiverHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Nv3DVPTransceiverHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type Nv3DVPTransceiverHandle = *mut Nv3DVPTransceiverHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct Nv3DVPGlassesHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Nv3DVPGlassesHandle__() {
    assert_eq!(
        ::std::mem::size_of::<Nv3DVPGlassesHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(Nv3DVPGlassesHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<Nv3DVPGlassesHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(Nv3DVPGlassesHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Nv3DVPGlassesHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Nv3DVPGlassesHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type Nv3DVPGlassesHandle = *mut Nv3DVPGlassesHandle__;
pub type StereoHandle = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvSourceHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvSourceHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvSourceHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvSourceHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvSourceHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvSourceHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvSourceHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvSourceHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvSourceHandle = *mut NvSourceHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvTargetHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvTargetHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvTargetHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvTargetHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvTargetHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvTargetHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvTargetHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvTargetHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvTargetHandle = *mut NvTargetHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVDX_SwapChainHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NVDX_SwapChainHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NVDX_SwapChainHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NVDX_SwapChainHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NVDX_SwapChainHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NVDX_SwapChainHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NVDX_SwapChainHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NVDX_SwapChainHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NVDX_SwapChainHandle = *mut NVDX_SwapChainHandle__;
extern "C" {
    pub static NVDX_SWAPCHAIN_NONE: NVDX_SwapChainHandle;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvPresentBarrierClientHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NvPresentBarrierClientHandle__() {
    assert_eq!(
        ::std::mem::size_of::<NvPresentBarrierClientHandle__>(),
        4usize,
        concat!("Size of: ", stringify!(NvPresentBarrierClientHandle__))
    );
    assert_eq!(
        ::std::mem::align_of::<NvPresentBarrierClientHandle__>(),
        4usize,
        concat!("Alignment of ", stringify!(NvPresentBarrierClientHandle__))
    );
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvPresentBarrierClientHandle__>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvPresentBarrierClientHandle__),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
}
pub type NvPresentBarrierClientHandle = *mut NvPresentBarrierClientHandle__;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvSBox {
    pub sX: NvS32,
    pub sY: NvS32,
    pub sWidth: NvS32,
    pub sHeight: NvS32,
}
#[test]
fn bindgen_test_layout_NvSBox() {
    assert_eq!(
        ::std::mem::size_of::<NvSBox>(),
        16usize,
        concat!("Size of: ", stringify!(NvSBox))
    );
    assert_eq!(
        ::std::mem::align_of::<NvSBox>(),
        4usize,
        concat!("Alignment of ", stringify!(NvSBox))
    );
    fn test_field_sX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvSBox>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sX) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvSBox),
                "::",
                stringify!(sX)
            )
        );
    }
    test_field_sX();
    fn test_field_sY() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvSBox>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sY) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NvSBox),
                "::",
                stringify!(sY)
            )
        );
    }
    test_field_sY();
    fn test_field_sWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvSBox>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sWidth) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NvSBox),
                "::",
                stringify!(sWidth)
            )
        );
    }
    test_field_sWidth();
    fn test_field_sHeight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvSBox>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sHeight) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NvSBox),
                "::",
                stringify!(sHeight)
            )
        );
    }
    test_field_sHeight();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NvGUID {
    pub data1: NvU32,
    pub data2: NvU16,
    pub data3: NvU16,
    pub data4: [NvU8; 8usize],
}
#[test]
fn bindgen_test_layout_NvGUID() {
    assert_eq!(
        ::std::mem::size_of::<NvGUID>(),
        16usize,
        concat!("Size of: ", stringify!(NvGUID))
    );
    assert_eq!(
        ::std::mem::align_of::<NvGUID>(),
        4usize,
        concat!("Alignment of ", stringify!(NvGUID))
    );
    fn test_field_data1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvGUID>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data1) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NvGUID),
                "::",
                stringify!(data1)
            )
        );
    }
    test_field_data1();
    fn test_field_data2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvGUID>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data2) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NvGUID),
                "::",
                stringify!(data2)
            )
        );
    }
    test_field_data2();
    fn test_field_data3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvGUID>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data3) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(NvGUID),
                "::",
                stringify!(data3)
            )
        );
    }
    test_field_data3();
    fn test_field_data4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NvGUID>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data4) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NvGUID),
                "::",
                stringify!(data4)
            )
        );
    }
    test_field_data4();
}
pub type NvLUID = NvGUID;
pub type NvAPI_String = [::std::os::raw::c_char; 4096usize];
pub type NvAPI_LongString = [::std::os::raw::c_char; 256usize];
pub type NvAPI_ShortString = [::std::os::raw::c_char; 64usize];
pub type NvAPI_UnicodeShortString = [NvU16; 64usize];
#[doc = "!< Success. Request is completed."]
pub const _NvAPI_Status_NVAPI_OK: _NvAPI_Status = 0;
#[doc = "!< Generic error"]
pub const _NvAPI_Status_NVAPI_ERROR: _NvAPI_Status = -1;
#[doc = "!< NVAPI support library cannot be loaded."]
pub const _NvAPI_Status_NVAPI_LIBRARY_NOT_FOUND: _NvAPI_Status = -2;
#[doc = "!< not implemented in current driver installation"]
pub const _NvAPI_Status_NVAPI_NO_IMPLEMENTATION: _NvAPI_Status = -3;
#[doc = "!< NvAPI_Initialize has not been called (successfully)"]
pub const _NvAPI_Status_NVAPI_API_NOT_INITIALIZED: _NvAPI_Status = -4;
#[doc = "!< The argument/parameter value is not valid or NULL."]
pub const _NvAPI_Status_NVAPI_INVALID_ARGUMENT: _NvAPI_Status = -5;
#[doc = "!< No NVIDIA display driver, or NVIDIA GPU driving a display, was found."]
pub const _NvAPI_Status_NVAPI_NVIDIA_DEVICE_NOT_FOUND: _NvAPI_Status = -6;
#[doc = "!< No more items to enumerate"]
pub const _NvAPI_Status_NVAPI_END_ENUMERATION: _NvAPI_Status = -7;
#[doc = "!< Invalid handle"]
pub const _NvAPI_Status_NVAPI_INVALID_HANDLE: _NvAPI_Status = -8;
#[doc = "!< An argument's structure version is not supported"]
pub const _NvAPI_Status_NVAPI_INCOMPATIBLE_STRUCT_VERSION: _NvAPI_Status = -9;
#[doc = "!< The handle is no longer valid (likely due to GPU or display re-configuration)"]
pub const _NvAPI_Status_NVAPI_HANDLE_INVALIDATED: _NvAPI_Status = -10;
#[doc = "!< No NVIDIA OpenGL context is current (but needs to be)"]
pub const _NvAPI_Status_NVAPI_OPENGL_CONTEXT_NOT_CURRENT: _NvAPI_Status = -11;
#[doc = "!< An invalid pointer, usually NULL, was passed as a parameter"]
pub const _NvAPI_Status_NVAPI_INVALID_POINTER: _NvAPI_Status = -14;
#[doc = "!< OpenGL Expert is not supported by the current drivers"]
pub const _NvAPI_Status_NVAPI_NO_GL_EXPERT: _NvAPI_Status = -12;
#[doc = "!< OpenGL Expert is supported, but driver instrumentation is currently disabled"]
pub const _NvAPI_Status_NVAPI_INSTRUMENTATION_DISABLED: _NvAPI_Status = -13;
#[doc = "!< OpenGL does not support Nsight"]
pub const _NvAPI_Status_NVAPI_NO_GL_NSIGHT: _NvAPI_Status = -15;
#[doc = "!< Expected a logical GPU handle for one or more parameters"]
pub const _NvAPI_Status_NVAPI_EXPECTED_LOGICAL_GPU_HANDLE: _NvAPI_Status = -100;
#[doc = "!< Expected a physical GPU handle for one or more parameters"]
pub const _NvAPI_Status_NVAPI_EXPECTED_PHYSICAL_GPU_HANDLE: _NvAPI_Status = -101;
#[doc = "!< Expected an NV display handle for one or more parameters"]
pub const _NvAPI_Status_NVAPI_EXPECTED_DISPLAY_HANDLE: _NvAPI_Status = -102;
#[doc = "!< The combination of parameters is not valid."]
pub const _NvAPI_Status_NVAPI_INVALID_COMBINATION: _NvAPI_Status = -103;
#[doc = "!< Requested feature is not supported in the selected GPU"]
pub const _NvAPI_Status_NVAPI_NOT_SUPPORTED: _NvAPI_Status = -104;
#[doc = "!< No port ID was found for the I2C transaction"]
pub const _NvAPI_Status_NVAPI_PORTID_NOT_FOUND: _NvAPI_Status = -105;
#[doc = "!< Expected an unattached display handle as one of the input parameters."]
pub const _NvAPI_Status_NVAPI_EXPECTED_UNATTACHED_DISPLAY_HANDLE: _NvAPI_Status = -106;
#[doc = "!< Invalid perf level"]
pub const _NvAPI_Status_NVAPI_INVALID_PERF_LEVEL: _NvAPI_Status = -107;
#[doc = "!< Device is busy; request not fulfilled"]
pub const _NvAPI_Status_NVAPI_DEVICE_BUSY: _NvAPI_Status = -108;
#[doc = "!< NV persist file is not found"]
pub const _NvAPI_Status_NVAPI_NV_PERSIST_FILE_NOT_FOUND: _NvAPI_Status = -109;
#[doc = "!< NV persist data is not found"]
pub const _NvAPI_Status_NVAPI_PERSIST_DATA_NOT_FOUND: _NvAPI_Status = -110;
#[doc = "!< Expected a TV output display"]
pub const _NvAPI_Status_NVAPI_EXPECTED_TV_DISPLAY: _NvAPI_Status = -111;
#[doc = "!< Expected a TV output on the D Connector - HDTV_EIAJ4120."]
pub const _NvAPI_Status_NVAPI_EXPECTED_TV_DISPLAY_ON_DCONNECTOR: _NvAPI_Status = -112;
#[doc = "!< SLI is not active on this device."]
pub const _NvAPI_Status_NVAPI_NO_ACTIVE_SLI_TOPOLOGY: _NvAPI_Status = -113;
#[doc = "!< Setup of SLI rendering mode is not possible right now."]
pub const _NvAPI_Status_NVAPI_SLI_RENDERING_MODE_NOTALLOWED: _NvAPI_Status = -114;
#[doc = "!< Expected a digital flat panel."]
pub const _NvAPI_Status_NVAPI_EXPECTED_DIGITAL_FLAT_PANEL: _NvAPI_Status = -115;
#[doc = "!< Argument exceeds the expected size."]
pub const _NvAPI_Status_NVAPI_ARGUMENT_EXCEED_MAX_SIZE: _NvAPI_Status = -116;
#[doc = "!< Inhibit is ON due to one of the flags in NV_GPU_DISPLAY_CHANGE_INHIBIT or SLI active."]
pub const _NvAPI_Status_NVAPI_DEVICE_SWITCHING_NOT_ALLOWED: _NvAPI_Status = -117;
#[doc = "!< Testing of clocks is not supported."]
pub const _NvAPI_Status_NVAPI_TESTING_CLOCKS_NOT_SUPPORTED: _NvAPI_Status = -118;
#[doc = "!< The specified underscan config is from an unknown source (e.g. INF)"]
pub const _NvAPI_Status_NVAPI_UNKNOWN_UNDERSCAN_CONFIG: _NvAPI_Status = -119;
#[doc = "!< Timeout while reconfiguring GPUs"]
pub const _NvAPI_Status_NVAPI_TIMEOUT_RECONFIGURING_GPU_TOPO: _NvAPI_Status = -120;
#[doc = "!< Requested data was not found"]
pub const _NvAPI_Status_NVAPI_DATA_NOT_FOUND: _NvAPI_Status = -121;
#[doc = "!< Expected an analog display"]
pub const _NvAPI_Status_NVAPI_EXPECTED_ANALOG_DISPLAY: _NvAPI_Status = -122;
#[doc = "!< No SLI video bridge is present"]
pub const _NvAPI_Status_NVAPI_NO_VIDLINK: _NvAPI_Status = -123;
#[doc = "!< NVAPI requires a reboot for the settings to take effect"]
pub const _NvAPI_Status_NVAPI_REQUIRES_REBOOT: _NvAPI_Status = -124;
#[doc = "!< The function is not supported with the current Hybrid mode."]
pub const _NvAPI_Status_NVAPI_INVALID_HYBRID_MODE: _NvAPI_Status = -125;
#[doc = "!< The target types are not all the same"]
pub const _NvAPI_Status_NVAPI_MIXED_TARGET_TYPES: _NvAPI_Status = -126;
#[doc = "!< The function is not supported from 32-bit on a 64-bit system."]
pub const _NvAPI_Status_NVAPI_SYSWOW64_NOT_SUPPORTED: _NvAPI_Status = -127;
#[doc = "!< There is no implicit GPU topology active. Use NVAPI_SetHybridMode to change topology."]
pub const _NvAPI_Status_NVAPI_IMPLICIT_SET_GPU_TOPOLOGY_CHANGE_NOT_ALLOWED: _NvAPI_Status = -128;
#[doc = "!< Prompt the user to close all non-migratable applications."]
pub const _NvAPI_Status_NVAPI_REQUEST_USER_TO_CLOSE_NON_MIGRATABLE_APPS: _NvAPI_Status = -129;
#[doc = "!< Could not allocate sufficient memory to complete the call."]
pub const _NvAPI_Status_NVAPI_OUT_OF_MEMORY: _NvAPI_Status = -130;
#[doc = "!< The previous operation that is transferring information to or from this surface is incomplete."]
pub const _NvAPI_Status_NVAPI_WAS_STILL_DRAWING: _NvAPI_Status = -131;
#[doc = "!< The file was not found."]
pub const _NvAPI_Status_NVAPI_FILE_NOT_FOUND: _NvAPI_Status = -132;
#[doc = "!< There are too many unique instances of a particular type of state object."]
pub const _NvAPI_Status_NVAPI_TOO_MANY_UNIQUE_STATE_OBJECTS: _NvAPI_Status = -133;
#[doc = "!< The method call is invalid. For example, a method's parameter may not be a valid pointer."]
pub const _NvAPI_Status_NVAPI_INVALID_CALL: _NvAPI_Status = -134;
#[doc = "!< d3d10_1.dll cannot be loaded."]
pub const _NvAPI_Status_NVAPI_D3D10_1_LIBRARY_NOT_FOUND: _NvAPI_Status = -135;
#[doc = "!< Couldn't find the function in the loaded DLL."]
pub const _NvAPI_Status_NVAPI_FUNCTION_NOT_FOUND: _NvAPI_Status = -136;
#[doc = "!< The application will require Administrator privileges to access this API."]
#[doc = "!< The application can be elevated to a higher permission level by selecting \"Run as Administrator\"."]
pub const _NvAPI_Status_NVAPI_INVALID_USER_PRIVILEGE: _NvAPI_Status = -137;
#[doc = "!< The handle corresponds to GDIPrimary."]
pub const _NvAPI_Status_NVAPI_EXPECTED_NON_PRIMARY_DISPLAY_HANDLE: _NvAPI_Status = -138;
#[doc = "!< Setting Physx GPU requires that the GPU is compute-capable."]
pub const _NvAPI_Status_NVAPI_EXPECTED_COMPUTE_GPU_HANDLE: _NvAPI_Status = -139;
#[doc = "!< The Stereo part of NVAPI failed to initialize completely. Check if the stereo driver is installed."]
pub const _NvAPI_Status_NVAPI_STEREO_NOT_INITIALIZED: _NvAPI_Status = -140;
#[doc = "!< Access to stereo-related registry keys or values has failed."]
pub const _NvAPI_Status_NVAPI_STEREO_REGISTRY_ACCESS_FAILED: _NvAPI_Status = -141;
#[doc = "!< The given registry profile type is not supported."]
pub const _NvAPI_Status_NVAPI_STEREO_REGISTRY_PROFILE_TYPE_NOT_SUPPORTED: _NvAPI_Status = -142;
#[doc = "!< The given registry value is not supported."]
pub const _NvAPI_Status_NVAPI_STEREO_REGISTRY_VALUE_NOT_SUPPORTED: _NvAPI_Status = -143;
#[doc = "!< Stereo is not enabled and the function needed it to execute completely."]
pub const _NvAPI_Status_NVAPI_STEREO_NOT_ENABLED: _NvAPI_Status = -144;
#[doc = "!< Stereo is not turned on and the function needed it to execute completely."]
pub const _NvAPI_Status_NVAPI_STEREO_NOT_TURNED_ON: _NvAPI_Status = -145;
#[doc = "!< Invalid device interface."]
pub const _NvAPI_Status_NVAPI_STEREO_INVALID_DEVICE_INTERFACE: _NvAPI_Status = -146;
#[doc = "!< Separation percentage or JPEG image capture quality is out of [0-100] range."]
pub const _NvAPI_Status_NVAPI_STEREO_PARAMETER_OUT_OF_RANGE: _NvAPI_Status = -147;
#[doc = "!< The given frustum adjust mode is not supported."]
pub const _NvAPI_Status_NVAPI_STEREO_FRUSTUM_ADJUST_MODE_NOT_SUPPORTED: _NvAPI_Status = -148;
#[doc = "!< The mosaic topology is not possible given the current state of the hardware."]
pub const _NvAPI_Status_NVAPI_TOPO_NOT_POSSIBLE: _NvAPI_Status = -149;
#[doc = "!< An attempt to do a display resolution mode change has failed."]
pub const _NvAPI_Status_NVAPI_MODE_CHANGE_FAILED: _NvAPI_Status = -150;
#[doc = "!< d3d11.dll/d3d11_beta.dll cannot be loaded."]
pub const _NvAPI_Status_NVAPI_D3D11_LIBRARY_NOT_FOUND: _NvAPI_Status = -151;
#[doc = "!< Address is outside of valid range."]
pub const _NvAPI_Status_NVAPI_INVALID_ADDRESS: _NvAPI_Status = -152;
#[doc = "!< The pre-allocated string is too small to hold the result."]
pub const _NvAPI_Status_NVAPI_STRING_TOO_SMALL: _NvAPI_Status = -153;
#[doc = "!< The input does not match any of the available devices."]
pub const _NvAPI_Status_NVAPI_MATCHING_DEVICE_NOT_FOUND: _NvAPI_Status = -154;
#[doc = "!< Driver is running."]
pub const _NvAPI_Status_NVAPI_DRIVER_RUNNING: _NvAPI_Status = -155;
#[doc = "!< Driver is not running."]
pub const _NvAPI_Status_NVAPI_DRIVER_NOTRUNNING: _NvAPI_Status = -156;
#[doc = "!< A driver reload is required to apply these settings."]
pub const _NvAPI_Status_NVAPI_ERROR_DRIVER_RELOAD_REQUIRED: _NvAPI_Status = -157;
#[doc = "!< Intended setting is not allowed."]
pub const _NvAPI_Status_NVAPI_SET_NOT_ALLOWED: _NvAPI_Status = -158;
#[doc = "!< Information can't be returned due to \"advanced display topology\"."]
pub const _NvAPI_Status_NVAPI_ADVANCED_DISPLAY_TOPOLOGY_REQUIRED: _NvAPI_Status = -159;
#[doc = "!< Setting is not found."]
pub const _NvAPI_Status_NVAPI_SETTING_NOT_FOUND: _NvAPI_Status = -160;
#[doc = "!< Setting size is too large."]
pub const _NvAPI_Status_NVAPI_SETTING_SIZE_TOO_LARGE: _NvAPI_Status = -161;
#[doc = "!< There are too many settings for a profile."]
pub const _NvAPI_Status_NVAPI_TOO_MANY_SETTINGS_IN_PROFILE: _NvAPI_Status = -162;
#[doc = "!< Profile is not found."]
pub const _NvAPI_Status_NVAPI_PROFILE_NOT_FOUND: _NvAPI_Status = -163;
#[doc = "!< Profile name is duplicated."]
pub const _NvAPI_Status_NVAPI_PROFILE_NAME_IN_USE: _NvAPI_Status = -164;
#[doc = "!< Profile name is empty."]
pub const _NvAPI_Status_NVAPI_PROFILE_NAME_EMPTY: _NvAPI_Status = -165;
#[doc = "!< Application not found in the Profile."]
pub const _NvAPI_Status_NVAPI_EXECUTABLE_NOT_FOUND: _NvAPI_Status = -166;
#[doc = "!< Application already exists in the other profile."]
pub const _NvAPI_Status_NVAPI_EXECUTABLE_ALREADY_IN_USE: _NvAPI_Status = -167;
#[doc = "!< Data Type mismatch"]
pub const _NvAPI_Status_NVAPI_DATATYPE_MISMATCH: _NvAPI_Status = -168;
#[doc = "!< The profile passed as parameter has been removed and is no longer valid."]
pub const _NvAPI_Status_NVAPI_PROFILE_REMOVED: _NvAPI_Status = -169;
#[doc = "!< An unregistered resource was passed as a parameter."]
pub const _NvAPI_Status_NVAPI_UNREGISTERED_RESOURCE: _NvAPI_Status = -170;
#[doc = "!< The DisplayId corresponds to a display which is not within the normal outputId range."]
pub const _NvAPI_Status_NVAPI_ID_OUT_OF_RANGE: _NvAPI_Status = -171;
#[doc = "!< Display topology is not valid so the driver cannot do a mode set on this configuration."]
pub const _NvAPI_Status_NVAPI_DISPLAYCONFIG_VALIDATION_FAILED: _NvAPI_Status = -172;
#[doc = "!< Display Port Multi-Stream topology has been changed."]
pub const _NvAPI_Status_NVAPI_DPMST_CHANGED: _NvAPI_Status = -173;
#[doc = "!< Input buffer is insufficient to hold the contents."]
pub const _NvAPI_Status_NVAPI_INSUFFICIENT_BUFFER: _NvAPI_Status = -174;
#[doc = "!< No access to the caller."]
pub const _NvAPI_Status_NVAPI_ACCESS_DENIED: _NvAPI_Status = -175;
#[doc = "!< The requested action cannot be performed without Mosaic being enabled."]
pub const _NvAPI_Status_NVAPI_MOSAIC_NOT_ACTIVE: _NvAPI_Status = -176;
#[doc = "!< The surface is relocated away from video memory."]
pub const _NvAPI_Status_NVAPI_SHARE_RESOURCE_RELOCATED: _NvAPI_Status = -177;
#[doc = "!< The user should disable DWM before calling NvAPI."]
pub const _NvAPI_Status_NVAPI_REQUEST_USER_TO_DISABLE_DWM: _NvAPI_Status = -178;
#[doc = "!< D3D device status is D3DERR_DEVICELOST or D3DERR_DEVICENOTRESET - the user has to reset the device."]
pub const _NvAPI_Status_NVAPI_D3D_DEVICE_LOST: _NvAPI_Status = -179;
#[doc = "!< The requested action cannot be performed in the current state."]
pub const _NvAPI_Status_NVAPI_INVALID_CONFIGURATION: _NvAPI_Status = -180;
#[doc = "!< Call failed as stereo handshake not completed."]
pub const _NvAPI_Status_NVAPI_STEREO_HANDSHAKE_NOT_DONE: _NvAPI_Status = -181;
#[doc = "!< The path provided was too short to determine the correct NVDRS_APPLICATION"]
pub const _NvAPI_Status_NVAPI_EXECUTABLE_PATH_IS_AMBIGUOUS: _NvAPI_Status = -182;
#[doc = "!< Default stereo profile is not currently defined"]
pub const _NvAPI_Status_NVAPI_DEFAULT_STEREO_PROFILE_IS_NOT_DEFINED: _NvAPI_Status = -183;
#[doc = "!< Default stereo profile does not exist"]
pub const _NvAPI_Status_NVAPI_DEFAULT_STEREO_PROFILE_DOES_NOT_EXIST: _NvAPI_Status = -184;
#[doc = "!< A cluster is already defined with the given configuration."]
pub const _NvAPI_Status_NVAPI_CLUSTER_ALREADY_EXISTS: _NvAPI_Status = -185;
#[doc = "!< The input display id is not that of a multi stream enabled connector or a display device in a multi stream topology"]
pub const _NvAPI_Status_NVAPI_DPMST_DISPLAY_ID_EXPECTED: _NvAPI_Status = -186;
#[doc = "!< The input display id is not valid or the monitor associated to it does not support the current operation"]
pub const _NvAPI_Status_NVAPI_INVALID_DISPLAY_ID: _NvAPI_Status = -187;
#[doc = "!< While playing secure audio stream, stream goes out of sync"]
pub const _NvAPI_Status_NVAPI_STREAM_IS_OUT_OF_SYNC: _NvAPI_Status = -188;
#[doc = "!< Older audio driver version than required"]
pub const _NvAPI_Status_NVAPI_INCOMPATIBLE_AUDIO_DRIVER: _NvAPI_Status = -189;
#[doc = "!< Value already set, setting again not allowed."]
pub const _NvAPI_Status_NVAPI_VALUE_ALREADY_SET: _NvAPI_Status = -190;
#[doc = "!< Requested operation timed out"]
pub const _NvAPI_Status_NVAPI_TIMEOUT: _NvAPI_Status = -191;
#[doc = "!< The requested workstation feature set has incomplete driver internal allocation resources"]
pub const _NvAPI_Status_NVAPI_GPU_WORKSTATION_FEATURE_INCOMPLETE: _NvAPI_Status = -192;
#[doc = "!< Call failed because InitActivation was not called."]
pub const _NvAPI_Status_NVAPI_STEREO_INIT_ACTIVATION_NOT_DONE: _NvAPI_Status = -193;
#[doc = "!< The requested action cannot be performed without Sync being enabled."]
pub const _NvAPI_Status_NVAPI_SYNC_NOT_ACTIVE: _NvAPI_Status = -194;
#[doc = "!< The requested action cannot be performed without Sync Master being enabled."]
pub const _NvAPI_Status_NVAPI_SYNC_MASTER_NOT_FOUND: _NvAPI_Status = -195;
#[doc = "!< Invalid displays passed in the NV_GSYNC_DISPLAY pointer."]
pub const _NvAPI_Status_NVAPI_INVALID_SYNC_TOPOLOGY: _NvAPI_Status = -196;
#[doc = "!< The specified signing algorithm is not supported. Either an incorrect value was entered or the current installed driver/hardware does not support the input value."]
pub const _NvAPI_Status_NVAPI_ECID_SIGN_ALGO_UNSUPPORTED: _NvAPI_Status = -197;
#[doc = "!< The encrypted public key verification has failed."]
pub const _NvAPI_Status_NVAPI_ECID_KEY_VERIFICATION_FAILED: _NvAPI_Status = -198;
#[doc = "!< The device's firmware is out of date."]
pub const _NvAPI_Status_NVAPI_FIRMWARE_OUT_OF_DATE: _NvAPI_Status = -199;
#[doc = "!< The device's firmware is not supported."]
pub const _NvAPI_Status_NVAPI_FIRMWARE_REVISION_NOT_SUPPORTED: _NvAPI_Status = -200;
#[doc = "!< The caller is not authorized to modify the License."]
pub const _NvAPI_Status_NVAPI_LICENSE_CALLER_AUTHENTICATION_FAILED: _NvAPI_Status = -201;
#[doc = "!< The user tried to use a deferred context without registering the device first"]
pub const _NvAPI_Status_NVAPI_D3D_DEVICE_NOT_REGISTERED: _NvAPI_Status = -202;
#[doc = "!< Head or SourceId was not reserved for the VR Display before doing the Modeset or the dedicated display."]
pub const _NvAPI_Status_NVAPI_RESOURCE_NOT_ACQUIRED: _NvAPI_Status = -203;
#[doc = "!< Provided timing is not supported."]
pub const _NvAPI_Status_NVAPI_TIMING_NOT_SUPPORTED: _NvAPI_Status = -204;
#[doc = "!< HDCP Encryption Failed for the device. Would be applicable when the device is HDCP Capable."]
pub const _NvAPI_Status_NVAPI_HDCP_ENCRYPTION_FAILED: _NvAPI_Status = -205;
#[doc = "!< Provided mode is over sink device pclk limitation."]
pub const _NvAPI_Status_NVAPI_PCLK_LIMITATION_FAILED: _NvAPI_Status = -206;
#[doc = "!< No connector on GPU found."]
pub const _NvAPI_Status_NVAPI_NO_CONNECTOR_FOUND: _NvAPI_Status = -207;
#[doc = "!< When a non-HDCP capable HMD is connected, we would inform user by this code."]
pub const _NvAPI_Status_NVAPI_HDCP_DISABLED: _NvAPI_Status = -208;
#[doc = "!< Atleast an API is still being called"]
pub const _NvAPI_Status_NVAPI_API_IN_USE: _NvAPI_Status = -209;
#[doc = "!< No display found on Nvidia GPU(s)."]
pub const _NvAPI_Status_NVAPI_NVIDIA_DISPLAY_NOT_FOUND: _NvAPI_Status = -210;
#[doc = "!< Priv security violation, improper access to a secured register."]
pub const _NvAPI_Status_NVAPI_PRIV_SEC_VIOLATION: _NvAPI_Status = -211;
#[doc = "!< NVAPI cannot be called by this vendor"]
pub const _NvAPI_Status_NVAPI_INCORRECT_VENDOR: _NvAPI_Status = -212;
#[doc = "!< DirectMode Display is already in use"]
pub const _NvAPI_Status_NVAPI_DISPLAY_IN_USE: _NvAPI_Status = -213;
#[doc = "!< The Config is having Non-NVidia GPU with Non-HDCP HMD connected"]
pub const _NvAPI_Status_NVAPI_UNSUPPORTED_CONFIG_NON_HDCP_HMD: _NvAPI_Status = -214;
#[doc = "!< GPU's Max Display Limit has Reached"]
pub const _NvAPI_Status_NVAPI_MAX_DISPLAY_LIMIT_REACHED: _NvAPI_Status = -215;
#[doc = "!< DirectMode not Enabled on the Display"]
pub const _NvAPI_Status_NVAPI_INVALID_DIRECT_MODE_DISPLAY: _NvAPI_Status = -216;
#[doc = "!< GPU is in debug mode, OC is NOT allowed."]
pub const _NvAPI_Status_NVAPI_GPU_IN_DEBUG_MODE: _NvAPI_Status = -217;
#[doc = "!< No NvAPI context was found for this D3D object"]
pub const _NvAPI_Status_NVAPI_D3D_CONTEXT_NOT_FOUND: _NvAPI_Status = -218;
#[doc = "!< there is version mismatch between stereo driver and dx driver"]
pub const _NvAPI_Status_NVAPI_STEREO_VERSION_MISMATCH: _NvAPI_Status = -219;
#[doc = "!< GPU is not powered and so the request cannot be completed."]
pub const _NvAPI_Status_NVAPI_GPU_NOT_POWERED: _NvAPI_Status = -220;
#[doc = "!< The display driver update in progress."]
pub const _NvAPI_Status_NVAPI_ERROR_DRIVER_RELOAD_IN_PROGRESS: _NvAPI_Status = -221;
#[doc = "!< Wait for HW resources allocation"]
pub const _NvAPI_Status_NVAPI_WAIT_FOR_HW_RESOURCE: _NvAPI_Status = -222;
#[doc = "!< operation requires further HDCP action"]
pub const _NvAPI_Status_NVAPI_REQUIRE_FURTHER_HDCP_ACTION: _NvAPI_Status = -223;
#[doc = "!< Dynamic Mux transition failure"]
pub const _NvAPI_Status_NVAPI_DISPLAY_MUX_TRANSITION_FAILED: _NvAPI_Status = -224;
#[doc = "!< Invalid DSC version"]
pub const _NvAPI_Status_NVAPI_INVALID_DSC_VERSION: _NvAPI_Status = -225;
#[doc = "!< Invalid DSC slice count"]
pub const _NvAPI_Status_NVAPI_INVALID_DSC_SLICECOUNT: _NvAPI_Status = -226;
#[doc = "!< Invalid DSC output BPP"]
pub const _NvAPI_Status_NVAPI_INVALID_DSC_OUTPUT_BPP: _NvAPI_Status = -227;
#[doc = "!< There was an error while loading nvapi.dll from the driver store."]
pub const _NvAPI_Status_NVAPI_FAILED_TO_LOAD_FROM_DRIVER_STORE: _NvAPI_Status = -228;
#[doc = "!< OpenGL does not export Vulkan fake extensions"]
pub const _NvAPI_Status_NVAPI_NO_VULKAN: _NvAPI_Status = -229;
#[doc = "!< A request for NvTOPPs telemetry CData has already been made and is pending a response."]
pub const _NvAPI_Status_NVAPI_REQUEST_PENDING: _NvAPI_Status = -230;
#[doc = "!< Operation cannot be performed because the resource is in use."]
pub const _NvAPI_Status_NVAPI_RESOURCE_IN_USE: _NvAPI_Status = -231;
#[doc = "!< Device kernel image is invalid"]
pub const _NvAPI_Status_NVAPI_INVALID_IMAGE: _NvAPI_Status = -232;
#[doc = "!< PTX JIT compilation failed"]
pub const _NvAPI_Status_NVAPI_INVALID_PTX: _NvAPI_Status = -233;
#[doc = "!< Uncorrectable NVLink error was detected during the execution"]
pub const _NvAPI_Status_NVAPI_NVLINK_UNCORRECTABLE: _NvAPI_Status = -234;
#[doc = "!< PTX JIT compiler library was not found."]
pub const _NvAPI_Status_NVAPI_JIT_COMPILER_NOT_FOUND: _NvAPI_Status = -235;
#[doc = "!< Device kernel source is invalid."]
pub const _NvAPI_Status_NVAPI_INVALID_SOURCE: _NvAPI_Status = -236;
#[doc = "!< While executing a kernel, the device encountered an illegal instruction."]
pub const _NvAPI_Status_NVAPI_ILLEGAL_INSTRUCTION: _NvAPI_Status = -237;
#[doc = "!< While executing a kernel, the device program counter wrapped its address space"]
pub const _NvAPI_Status_NVAPI_INVALID_PC: _NvAPI_Status = -238;
#[doc = "!< An exception occurred on the device while executing a kernel"]
pub const _NvAPI_Status_NVAPI_LAUNCH_FAILED: _NvAPI_Status = -239;
#[doc = "!< Attempted operation is not permitted."]
pub const _NvAPI_Status_NVAPI_NOT_PERMITTED: _NvAPI_Status = -240;
#[doc = "! NvAPI Status Values"]
#[doc = "!   All NvAPI functions return one of these codes."]
#[doc = "!   \\ingroup nvapistatus"]
pub type _NvAPI_Status = ::std::os::raw::c_int;
#[doc = "! NvAPI Status Values"]
#[doc = "!   All NvAPI functions return one of these codes."]
#[doc = "!   \\ingroup nvapistatus"]
pub use self::_NvAPI_Status as NvAPI_Status;
extern "C" {
    #[doc = "!   DESCRIPTION: This API returns display driver version and driver-branch string."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\param [out]  pDriverVersion         Contains the driver version after successful return."]
    #[doc = "! \\param [out]  szBuildBranchString    Contains the driver-branch string after successful return."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_INVALID_ARGUMENT: either pDriverVersion is NULL or enum index too big"]
    #[doc = "! \\retval ::NVAPI_OK - completed request"]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED - NVAPI not initialized"]
    #[doc = "! \\retval ::NVAPI_ERROR - miscellaneous error occurred"]
    #[doc = "!"]
    #[doc = "! \\ingroup driverapi"]
    #[doc = ""]
    pub fn NvAPI_SYS_GetDriverAndBranchVersion(
        pDriverVersion: *mut NvU32,
        szBuildBranchString: *mut ::std::os::raw::c_char,
    ) -> NvAPI_Status;
}
#[doc = "! \\ingroup driverapi"]
#[doc = "! Used in NvAPI_GPU_GetMemoryInfo()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_DISPLAY_DRIVER_MEMORY_INFO_V1 {
    #[doc = "!< Version info"]
    pub version: NvU32,
    #[doc = "!< Size(in kb) of the physical framebuffer."]
    pub dedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of the available physical framebuffer for allocating video memory surfaces."]
    pub availableDedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of system memory the driver allocates at load time."]
    pub systemVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of shared system memory that driver is allowed to commit for surfaces across all allocations."]
    pub sharedSystemMemory: NvU32,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_DRIVER_MEMORY_INFO_V1() {
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>(),
        20usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1)
        )
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_dedicatedVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dedicatedVideoMemory) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
                "::",
                stringify!(dedicatedVideoMemory)
            )
        );
    }
    test_field_dedicatedVideoMemory();
    fn test_field_availableDedicatedVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).availableDedicatedVideoMemory) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
                "::",
                stringify!(availableDedicatedVideoMemory)
            )
        );
    }
    test_field_availableDedicatedVideoMemory();
    fn test_field_systemVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).systemVideoMemory) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
                "::",
                stringify!(systemVideoMemory)
            )
        );
    }
    test_field_systemVideoMemory();
    fn test_field_sharedSystemMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sharedSystemMemory) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V1),
                "::",
                stringify!(sharedSystemMemory)
            )
        );
    }
    test_field_sharedSystemMemory();
}
#[doc = "! \\ingroup driverapi"]
#[doc = "! Used in NvAPI_GPU_GetMemoryInfo()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_DISPLAY_DRIVER_MEMORY_INFO_V2 {
    #[doc = "!< Version info"]
    pub version: NvU32,
    #[doc = "!< Size(in kb) of the physical framebuffer."]
    pub dedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of the available physical framebuffer for allocating video memory surfaces."]
    pub availableDedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of system memory the driver allocates at load time."]
    pub systemVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of shared system memory that driver is allowed to commit for surfaces across all allocations."]
    pub sharedSystemMemory: NvU32,
    #[doc = "!< Size(in kb) of the current available physical framebuffer for allocating video memory surfaces."]
    pub curAvailableDedicatedVideoMemory: NvU32,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_DRIVER_MEMORY_INFO_V2() {
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>(),
        24usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2)
        )
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_dedicatedVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dedicatedVideoMemory) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
                "::",
                stringify!(dedicatedVideoMemory)
            )
        );
    }
    test_field_dedicatedVideoMemory();
    fn test_field_availableDedicatedVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).availableDedicatedVideoMemory) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
                "::",
                stringify!(availableDedicatedVideoMemory)
            )
        );
    }
    test_field_availableDedicatedVideoMemory();
    fn test_field_systemVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).systemVideoMemory) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
                "::",
                stringify!(systemVideoMemory)
            )
        );
    }
    test_field_systemVideoMemory();
    fn test_field_sharedSystemMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sharedSystemMemory) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
                "::",
                stringify!(sharedSystemMemory)
            )
        );
    }
    test_field_sharedSystemMemory();
    fn test_field_curAvailableDedicatedVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).curAvailableDedicatedVideoMemory) as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V2),
                "::",
                stringify!(curAvailableDedicatedVideoMemory)
            )
        );
    }
    test_field_curAvailableDedicatedVideoMemory();
}
#[doc = "! \\ingroup driverapi"]
#[doc = "! Used in NvAPI_GPU_GetMemoryInfo()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_DISPLAY_DRIVER_MEMORY_INFO_V3 {
    #[doc = "!< Version info"]
    pub version: NvU32,
    #[doc = "!< Size(in kb) of the physical framebuffer."]
    pub dedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of the available physical framebuffer for allocating video memory surfaces."]
    pub availableDedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of system memory the driver allocates at load time."]
    pub systemVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of shared system memory that driver is allowed to commit for surfaces across all allocations."]
    pub sharedSystemMemory: NvU32,
    #[doc = "!< Size(in kb) of the current available physical framebuffer for allocating video memory surfaces."]
    pub curAvailableDedicatedVideoMemory: NvU32,
    #[doc = "!< Size(in kb) of the total size of memory released as a result of the evictions."]
    pub dedicatedVideoMemoryEvictionsSize: NvU32,
    #[doc = "!< Indicates the number of eviction events that caused an allocation to be removed from dedicated video memory to free GPU"]
    #[doc = "!< video memory to make room for other allocations."]
    pub dedicatedVideoMemoryEvictionCount: NvU32,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_DRIVER_MEMORY_INFO_V3() {
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>(),
        32usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3)
        )
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_dedicatedVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dedicatedVideoMemory) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
                "::",
                stringify!(dedicatedVideoMemory)
            )
        );
    }
    test_field_dedicatedVideoMemory();
    fn test_field_availableDedicatedVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).availableDedicatedVideoMemory) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
                "::",
                stringify!(availableDedicatedVideoMemory)
            )
        );
    }
    test_field_availableDedicatedVideoMemory();
    fn test_field_systemVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).systemVideoMemory) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
                "::",
                stringify!(systemVideoMemory)
            )
        );
    }
    test_field_systemVideoMemory();
    fn test_field_sharedSystemMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sharedSystemMemory) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
                "::",
                stringify!(sharedSystemMemory)
            )
        );
    }
    test_field_sharedSystemMemory();
    fn test_field_curAvailableDedicatedVideoMemory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).curAvailableDedicatedVideoMemory) as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
                "::",
                stringify!(curAvailableDedicatedVideoMemory)
            )
        );
    }
    test_field_curAvailableDedicatedVideoMemory();
    fn test_field_dedicatedVideoMemoryEvictionsSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dedicatedVideoMemoryEvictionsSize) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
                "::",
                stringify!(dedicatedVideoMemoryEvictionsSize)
            )
        );
    }
    test_field_dedicatedVideoMemoryEvictionsSize();
    fn test_field_dedicatedVideoMemoryEvictionCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_MEMORY_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dedicatedVideoMemoryEvictionCount) as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_MEMORY_INFO_V3),
                "::",
                stringify!(dedicatedVideoMemoryEvictionCount)
            )
        );
    }
    test_field_dedicatedVideoMemoryEvictionCount();
}
#[doc = "! \\ingroup driverapi"]
#[doc = "! Used in NvAPI_GPU_GetMemoryInfo()."]
pub type NV_DISPLAY_DRIVER_MEMORY_INFO = NV_DISPLAY_DRIVER_MEMORY_INFO_V3;
extern "C" {
    #[doc = "!   DESCRIPTION: This function retrieves the available driver memory footprint for the specified GPU."]
    #[doc = "!                If the GPU is in TCC Mode, only dedicatedVideoMemory will be returned in pMemoryInfo (NV_DISPLAY_DRIVER_MEMORY_INFO)."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! TCC_SUPPORTED"]
    #[doc = "!"]
    #[doc = "! \\since Release: 177"]
    #[doc = "!"]
    #[doc = "!  \\param [in]   hPhysicalGpu  Handle of the physical GPU for which the memory information is to be extracted."]
    #[doc = "!  \\param [out]  pMemoryInfo   The memory footprint available in the driver. See NV_DISPLAY_DRIVER_MEMORY_INFO."]
    #[doc = "!"]
    #[doc = "!  \\retval       NVAPI_INVALID_ARGUMENT             pMemoryInfo is NULL."]
    #[doc = "!  \\retval       NVAPI_OK                           Call successful."]
    #[doc = "!  \\retval       NVAPI_NVIDIA_DEVICE_NOT_FOUND      No NVIDIA GPU driving a display was found."]
    #[doc = "!  \\retval       NVAPI_INCOMPATIBLE_STRUCT_VERSION  NV_DISPLAY_DRIVER_MEMORY_INFO structure version mismatch."]
    #[doc = "!"]
    #[doc = "!  \\ingroup  driverapi"]
    #[doc = ""]
    pub fn NvAPI_GPU_GetMemoryInfo(
        hPhysicalGpu: NvPhysicalGpuHandle,
        pMemoryInfo: *mut NV_DISPLAY_DRIVER_MEMORY_INFO,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns an array of physical GPU handles."]
    #[doc = "! Each handle represents a physical GPU present in the system."]
    #[doc = "! That GPU may be part of an SLI configuration, or may not be visible to the OS directly."]
    #[doc = "!"]
    #[doc = "! At least one GPU must be present in the system and running an NVIDIA display driver."]
    #[doc = "!"]
    #[doc = "! The array nvGPUHandle will be filled with physical GPU handle values. The returned"]
    #[doc = "! gpuCount determines how many entries in the array are valid."]
    #[doc = "!"]
    #[doc = "! \\note In drivers older than 105.00, all physical GPU handles get invalidated on a"]
    #[doc = "!       modeset. So the calling applications need to renum the handles after every modeset.\\n"]
    #[doc = "!       With drivers 105.00 and up, all physical GPU handles are constant."]
    #[doc = "!       Physical GPU handles are constant as long as the GPUs are not physically moved and"]
    #[doc = "!       the SBIOS VGA order is unchanged."]
    #[doc = "!"]
    #[doc = "!       For GPU handles in TCC MODE please use NvAPI_EnumTCCPhysicalGPUs()"]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\par Introduced in"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\retval NVAPI_INVALID_ARGUMENT         nvGPUHandle or pGpuCount is NULL"]
    #[doc = "! \\retval NVAPI_OK                       One or more handles were returned"]
    #[doc = "! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found"]
    #[doc = "! \\ingroup gpu"]
    #[doc = ""]
    pub fn NvAPI_EnumPhysicalGPUs(
        nvGPUHandle: *mut NvPhysicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
#[doc = "! \\ingroup dx"]
#[doc = "! Used in NvAPI_D3D10_GetCurrentSLIState(), and NvAPI_D3D_GetCurrentSLIState()."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_GET_CURRENT_SLI_STATE_V1 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    #[doc = "!< [OUT] The maximum possible value of numAFRGroups"]
    pub maxNumAFRGroups: NvU32,
    #[doc = "!< [OUT] The number of AFR groups enabled in the system"]
    pub numAFRGroups: NvU32,
    #[doc = "!< [OUT] The AFR group index for the frame currently being rendered"]
    pub currentAFRIndex: NvU32,
    #[doc = "!< [OUT] What the AFR group index will be for the next frame (i.e. after calling Present)"]
    pub nextFrameAFRIndex: NvU32,
    #[doc = "!< [OUT] The AFR group index that was used for the previous frame (~0 if more than one frame has not been rendered yet)"]
    pub previousFrameAFRIndex: NvU32,
    #[doc = "!< [OUT] Boolean: Is this frame the first time running on the current AFR group"]
    pub bIsCurAFRGroupNew: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GET_CURRENT_SLI_STATE_V1() {
    assert_eq!(
        ::std::mem::size_of::<NV_GET_CURRENT_SLI_STATE_V1>(),
        28usize,
        concat!("Size of: ", stringify!(NV_GET_CURRENT_SLI_STATE_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GET_CURRENT_SLI_STATE_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GET_CURRENT_SLI_STATE_V1))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V1),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_maxNumAFRGroups() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxNumAFRGroups) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V1),
                "::",
                stringify!(maxNumAFRGroups)
            )
        );
    }
    test_field_maxNumAFRGroups();
    fn test_field_numAFRGroups() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numAFRGroups) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V1),
                "::",
                stringify!(numAFRGroups)
            )
        );
    }
    test_field_numAFRGroups();
    fn test_field_currentAFRIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).currentAFRIndex) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V1),
                "::",
                stringify!(currentAFRIndex)
            )
        );
    }
    test_field_currentAFRIndex();
    fn test_field_nextFrameAFRIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nextFrameAFRIndex) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V1),
                "::",
                stringify!(nextFrameAFRIndex)
            )
        );
    }
    test_field_nextFrameAFRIndex();
    fn test_field_previousFrameAFRIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).previousFrameAFRIndex) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V1),
                "::",
                stringify!(previousFrameAFRIndex)
            )
        );
    }
    test_field_previousFrameAFRIndex();
    fn test_field_bIsCurAFRGroupNew() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bIsCurAFRGroupNew) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V1),
                "::",
                stringify!(bIsCurAFRGroupNew)
            )
        );
    }
    test_field_bIsCurAFRGroupNew();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_GET_CURRENT_SLI_STATE_V2 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    #[doc = "!< [OUT] The maximum possible value of numAFRGroups"]
    pub maxNumAFRGroups: NvU32,
    #[doc = "!< [OUT] The number of AFR groups enabled in the system"]
    pub numAFRGroups: NvU32,
    #[doc = "!< [OUT] The AFR group index for the frame currently being rendered"]
    pub currentAFRIndex: NvU32,
    #[doc = "!< [OUT] What the AFR group index will be for the next frame (i.e. after calling Present)"]
    pub nextFrameAFRIndex: NvU32,
    #[doc = "!< [OUT] The AFR group index that was used for the previous frame (~0 if more than one frame has not been rendered yet)"]
    pub previousFrameAFRIndex: NvU32,
    #[doc = "!< [OUT] Boolean: Is this frame the first time running on the current AFR group"]
    pub bIsCurAFRGroupNew: NvU32,
    #[doc = "!< [OUT] The number of GPUs used in VR-SLI. If it is 0 VR-SLI is not active"]
    pub numVRSLIGpus: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GET_CURRENT_SLI_STATE_V2() {
    assert_eq!(
        ::std::mem::size_of::<NV_GET_CURRENT_SLI_STATE_V2>(),
        32usize,
        concat!("Size of: ", stringify!(NV_GET_CURRENT_SLI_STATE_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GET_CURRENT_SLI_STATE_V2>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GET_CURRENT_SLI_STATE_V2))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V2),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_maxNumAFRGroups() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxNumAFRGroups) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V2),
                "::",
                stringify!(maxNumAFRGroups)
            )
        );
    }
    test_field_maxNumAFRGroups();
    fn test_field_numAFRGroups() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numAFRGroups) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V2),
                "::",
                stringify!(numAFRGroups)
            )
        );
    }
    test_field_numAFRGroups();
    fn test_field_currentAFRIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).currentAFRIndex) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V2),
                "::",
                stringify!(currentAFRIndex)
            )
        );
    }
    test_field_currentAFRIndex();
    fn test_field_nextFrameAFRIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nextFrameAFRIndex) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V2),
                "::",
                stringify!(nextFrameAFRIndex)
            )
        );
    }
    test_field_nextFrameAFRIndex();
    fn test_field_previousFrameAFRIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).previousFrameAFRIndex) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V2),
                "::",
                stringify!(previousFrameAFRIndex)
            )
        );
    }
    test_field_previousFrameAFRIndex();
    fn test_field_bIsCurAFRGroupNew() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bIsCurAFRGroupNew) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V2),
                "::",
                stringify!(bIsCurAFRGroupNew)
            )
        );
    }
    test_field_bIsCurAFRGroupNew();
    fn test_field_numVRSLIGpus() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GET_CURRENT_SLI_STATE_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numVRSLIGpus) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GET_CURRENT_SLI_STATE_V2),
                "::",
                stringify!(numVRSLIGpus)
            )
        );
    }
    test_field_numVRSLIGpus();
}
extern "C" {
    #[doc = "! DESCRIPTION:     This API returns the Display ID of the GDI Primary."]
    #[doc = "!"]
    #[doc = "! \\param [out]     displayId   Display ID of the GDI Primary display."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK:                          Capabilties have been returned."]
    #[doc = "! \\retval ::NVAPI_NVIDIA_DEVICE_NOT_FOUND:     GDI Primary not on an NVIDIA GPU."]
    #[doc = "! \\retval ::NVAPI_INVALID_ARGUMENT:            One or more args passed in are invalid."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED:          The NvAPI API needs to be initialized first"]
    #[doc = "! \\retval ::NVAPI_NO_IMPLEMENTATION:           This entrypoint not available"]
    #[doc = "! \\retval ::NVAPI_ERROR:                       Miscellaneous error occurred"]
    #[doc = "!"]
    #[doc = "! \\ingroup dispcontrol"]
    #[doc = ""]
    pub fn NvAPI_DISP_GetGDIPrimaryDisplayId(displayId: *mut NvU32) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:     This API returns the viewports that would be applied on"]
    #[doc = "!                  the requested display."]
    #[doc = "!"]
    #[doc = "! \\param [in]      displayId       Display ID of a single display in the active"]
    #[doc = "!                                  mosaic topology to query."]
    #[doc = "! \\param [in]      srcWidth        Width of full display topology. If both"]
    #[doc = "!                                  width and height are 0, the current"]
    #[doc = "!                                  resolution is used."]
    #[doc = "! \\param [in]      srcHeight       Height of full display topology. If both"]
    #[doc = "!                                  width and height are 0, the current"]
    #[doc = "!                                  resolution is used."]
    #[doc = "! \\param [out]     viewports       Array of NV_RECT viewports which represent"]
    #[doc = "!                                  the displays as identified in"]
    #[doc = "!                                  NvAPI_Mosaic_EnumGridTopologies. If the"]
    #[doc = "!                                  requested resolution is a single-wide"]
    #[doc = "!                                  resolution, only viewports[0] will"]
    #[doc = "!                                  contain the viewport details, regardless"]
    #[doc = "!                                  of which display is driving the display."]
    #[doc = "! \\param [out]     bezelCorrected  Returns 1 if the requested resolution is"]
    #[doc = "!                                  bezel corrected. May be NULL."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                          Capabilties have been returned."]
    #[doc = "! \\retval ::NVAPI_INVALID_ARGUMENT            One or more args passed in are invalid."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED          The NvAPI API needs to be initialized first"]
    #[doc = "! \\retval ::NVAPI_MOSAIC_NOT_ACTIVE           The display does not belong to an active Mosaic Topology"]
    #[doc = "! \\retval ::NVAPI_NO_IMPLEMENTATION           This entrypoint not available"]
    #[doc = "! \\retval ::NVAPI_ERROR                       Miscellaneous error occurred"]
    #[doc = "!"]
    #[doc = "! \\ingroup mosaicapi"]
    #[doc = ""]
    pub fn NvAPI_Mosaic_GetDisplayViewportsByResolution(
        displayId: NvU32,
        srcWidth: NvU32,
        srcHeight: NvU32,
        viewports: *mut NV_RECT,
        bezelCorrected: *mut NvU8,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This APU enables stereo mode in the registry."]
    #[doc = "!                Calls to this function affect the entire system."]
    #[doc = "!                If stereo is not enabled, then calls to functions that require that stereo is enabled have no effect,"]
    #[doc = "!                and will return the appropriate error code."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                      Stereo is now enabled."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED  Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_Enable() -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API disables stereo mode in the registry."]
    #[doc = "!                Calls to this function affect the entire system."]
    #[doc = "!                If stereo is not enabled, then calls to functions that require that stereo is enabled have no effect,"]
    #[doc = "!                and will return the appropriate error code."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                     Stereo is now disabled."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_Disable() -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API checks if stereo mode is enabled in the registry."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [out]     pIsStereoEnabled   Address where the result of the inquiry will be placed."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                       Check was sucessfully completed and result reflects current state of stereo availability."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED   Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_IsEnabled(pIsStereoEnabled: *mut NvU8) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API destroys the stereo handle created with one of the NvAPI_Stereo_CreateHandleFrom() functions."]
    #[doc = "!                This should be called after the device corresponding to the handle has been destroyed."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [in]     stereoHandle  Stereo handle that is to be destroyed."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                      Stereo handle is destroyed."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED  Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_DestroyHandle(stereoHandle: StereoHandle) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API activates stereo for the device interface corresponding to the given stereo handle."]
    #[doc = "!                Activating stereo is possible only if stereo was enabled previously in the registry."]
    #[doc = "!                If stereo is not activated, then calls to functions that require that stereo is activated have no effect,"]
    #[doc = "!                and will return the appropriate error code."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [in]    stereoHandle  Stereo handle corresponding to the device interface."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                                Stereo is turned on."]
    #[doc = "! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE   Device interface is not valid. Create again, then attach again."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED            Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_Activate(stereoHandle: StereoHandle) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API deactivates stereo for the given device interface."]
    #[doc = "!                If stereo is not activated, then calls to functions that require that stereo is activated have no effect,"]
    #[doc = "!                and will return the appropriate error code."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [in]     stereoHandle  Stereo handle that corresponds to the device interface."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                               Stereo is turned off."]
    #[doc = "! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE  Device interface is not valid. Create again, then attach again."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED           Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_Deactivate(stereoHandle: StereoHandle) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API checks if stereo is activated for the given device interface."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [in]    stereoHandle  Stereo handle that corresponds to the device interface."]
    #[doc = "! \\param [in]    pIsStereoOn   Address where result of the inquiry will be placed."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK - Check was sucessfully completed and result reflects current state of stereo (on/off)."]
    #[doc = "! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE - Device interface is not valid. Create again, then attach again."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED - NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED - Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR - Something is wrong (generic error)."]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_IsActivated(
        stereoHandle: StereoHandle,
        pIsStereoOn: *mut NvU8,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API gets current separation value (in percents)."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [in]     stereoHandle           Stereo handle that corresponds to the device interface."]
    #[doc = "! \\param [out]    pSeparationPercentage  Address of @c float type variable to store current separation percentage in."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                                Retrieval of separation percentage was successfull."]
    #[doc = "! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE   Device interface is not valid. Create again, then attach again."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED            Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_GetSeparation(
        stereoHandle: StereoHandle,
        pSeparationPercentage: *mut f32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API sets separation to given percentage."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to appropriate NvAPI_Stereo_CreateHandleFrom() function."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [in]     stereoHandle             Stereo handle that corresponds to the device interface."]
    #[doc = "! \\param [in]     newSeparationPercentage  New value for separation percentage."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                               Setting of separation percentage was successfull."]
    #[doc = "! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE  Device interface is not valid. Create again, then attach again."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED               NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED           Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_STEREO_PARAMETER_OUT_OF_RANGE    Given separation percentage is out of [0..100] range."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_SetSeparation(
        stereoHandle: StereoHandle,
        newSeparationPercentage: f32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API gets the current convergence value."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [in]     stereoHandle   Stereo handle that corresponds to the device interface."]
    #[doc = "! \\param [out]    pConvergence   Address of @c float type variable to store current convergence value in."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                               Retrieval of convergence value was successfull."]
    #[doc = "! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE  Device interface is not valid. Create again, then attach again."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED           Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_GetConvergence(
        stereoHandle: StereoHandle,
        pConvergence: *mut f32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API sets convergence to the given value."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE:   After the stereo handle for the device interface is created via successfull call to the appropriate NvAPI_Stereo_CreateHandleFrom() function."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 180"]
    #[doc = "!"]
    #[doc = "! \\param [in]     stereoHandle              Stereo handle that corresponds to the device interface."]
    #[doc = "! \\param [in]     newConvergence            New value for convergence."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                                Setting of convergence value was successfull."]
    #[doc = "! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE   Device interface is not valid. Create again, then attach again."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED"]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED            Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_SetConvergence(
        stereoHandle: StereoHandle,
        newConvergence: f32,
    ) -> NvAPI_Status;
}
pub const _NV_StereoActiveEye_NVAPI_STEREO_EYE_RIGHT: _NV_StereoActiveEye = 1;
pub const _NV_StereoActiveEye_NVAPI_STEREO_EYE_LEFT: _NV_StereoActiveEye = 2;
pub const _NV_StereoActiveEye_NVAPI_STEREO_EYE_MONO: _NV_StereoActiveEye = 3;
#[doc = "! \\ingroup stereoapi"]
pub type _NV_StereoActiveEye = ::std::os::raw::c_int;
#[doc = "! \\ingroup stereoapi"]
pub use self::_NV_StereoActiveEye as NV_STEREO_ACTIVE_EYE;
extern "C" {
    #[doc = "! \\ingroup stereoapi"]
    pub fn NvAPI_Stereo_SetActiveEye(
        hStereoHandle: StereoHandle,
        StereoEye: NV_STEREO_ACTIVE_EYE,
    ) -> NvAPI_Status;
}
pub const _NV_StereoDriverMode_NVAPI_STEREO_DRIVER_MODE_AUTOMATIC: _NV_StereoDriverMode = 0;
pub const _NV_StereoDriverMode_NVAPI_STEREO_DRIVER_MODE_DIRECT: _NV_StereoDriverMode = 2;
#[doc = "! \\ingroup stereoapi"]
pub type _NV_StereoDriverMode = ::std::os::raw::c_int;
#[doc = "! \\ingroup stereoapi"]
pub use self::_NV_StereoDriverMode as NV_STEREO_DRIVER_MODE;
extern "C" {
    #[doc = "! \\ingroup stereoapi"]
    pub fn NvAPI_Stereo_SetDriverMode(mode: NV_STEREO_DRIVER_MODE) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API returns eye separation as a ratio of <between eye distance>/<physical screen width>."]
    #[doc = "!"]
    #[doc = "! HOW TO USE:    After the stereo handle for device interface is created via successfull call to appropriate API. Applies only to DirectX 9 and up."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\param [in]   stereoHandle  Stereo handle that corresponds to the device interface."]
    #[doc = "! \\param [out]  pSeparation   Eye separation."]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                               Active eye is set."]
    #[doc = "! \\retval ::NVAPI_STEREO_INVALID_DEVICE_INTERFACE  Device interface is not valid. Create again, then attach again."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED               NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED           Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR  (generic error)."]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_GetEyeSeparation(
        hStereoHandle: StereoHandle,
        pSeparation: *mut f32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! DESCRIPTION:   This API returns availability of windowed mode stereo"]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\param [out] bSupported(OUT)    != 0  - supported,  \\n"]
    #[doc = "!                                 == 0  - is not supported"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\retval ::NVAPI_OK                      Retrieval of frustum adjust mode was successfull."]
    #[doc = "! \\retval ::NVAPI_API_NOT_INTIALIZED      NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_STEREO_NOT_INITIALIZED  Stereo part of NVAPI not initialized."]
    #[doc = "! \\retval ::NVAPI_ERROR                   Something is wrong (generic error)."]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_IsWindowedModeSupported(bSupported: *mut NvU8) -> NvAPI_Status;
}
#[doc = "!< Use driver registry profile settings for surface creation mode."]
pub const _NVAPI_STEREO_SURFACECREATEMODE_NVAPI_STEREO_SURFACECREATEMODE_AUTO:
    _NVAPI_STEREO_SURFACECREATEMODE = 0;
#[doc = "!< Always create stereo surfaces."]
pub const _NVAPI_STEREO_SURFACECREATEMODE_NVAPI_STEREO_SURFACECREATEMODE_FORCESTEREO:
    _NVAPI_STEREO_SURFACECREATEMODE = 1;
#[doc = "!< Always create mono surfaces."]
pub const _NVAPI_STEREO_SURFACECREATEMODE_NVAPI_STEREO_SURFACECREATEMODE_FORCEMONO:
    _NVAPI_STEREO_SURFACECREATEMODE = 2;
#[doc = "! \\ingroup stereoapi"]
pub type _NVAPI_STEREO_SURFACECREATEMODE = ::std::os::raw::c_int;
#[doc = "! \\ingroup stereoapi"]
pub use self::_NVAPI_STEREO_SURFACECREATEMODE as NVAPI_STEREO_SURFACECREATEMODE;
extern "C" {
    #[doc = "! \\ingroup stereoapi"]
    pub fn NvAPI_Stereo_SetSurfaceCreationMode(
        hStereoHandle: StereoHandle,
        creationMode: NVAPI_STEREO_SURFACECREATEMODE,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\ingroup stereoapi"]
    pub fn NvAPI_Stereo_GetSurfaceCreationMode(
        hStereoHandle: StereoHandle,
        pCreationMode: *mut NVAPI_STEREO_SURFACECREATEMODE,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\param [in]  hStereoHandle    Stereo handle that corresponds to the device interface."]
    #[doc = "! \\param [out] pWasStereoized   Address where result of the inquiry will be placed."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! DESCRIPTION: This API checks if the last draw call was stereoized. It is a very expensive to call and should be used for debugging purpose *only*."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE: After the stereo handle for device interface is created via successful call to appropriate NvAPI_Stereo_CreateHandleFrom function."]
    #[doc = "!"]
    #[doc = "! \\return      This API can return any of the error codes enumerated in #NvAPI_Status."]
    #[doc = "!              There are no return error codes with specific meaning for this API."]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_Debug_WasLastDrawStereoized(
        hStereoHandle: StereoHandle,
        pWasStereoized: *mut NvU8,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! DESCRIPTION: This API defines the stereo profile used by the driver in case the application has no associated profile."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE: To take effect, this API must be called before D3D device is created. Calling once a device has been created will not affect the current device."]
    #[doc = "!"]
    #[doc = "! \\param [in]  szProfileName        Default profile name."]
    #[doc = "!"]
    #[doc = "! \\return      This API can return any of the error codes enumerated in #NvAPI_Status."]
    #[doc = "!              Error codes specific to this API are described below."]
    #[doc = "!"]
    #[doc = "! \\retval      NVAPI_SUCCESS                               - Default stereo profile name has been copied into szProfileName."]
    #[doc = "! \\retval      NVAPI_INVALID_ARGUMENT                      - szProfileName == NULL."]
    #[doc = "! \\retval      NVAPI_DEFAULT_STEREO_PROFILE_DOES_NOT_EXIST - Default stereo profile does not exist"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_SetDefaultProfile(
        szProfileName: *const ::std::os::raw::c_char,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! DESCRIPTION: This API retrieves the current default stereo profile."]
    #[doc = "!"]
    #[doc = "!              After call cbSizeOut contain 0 if default profile is not set required buffer size cbSizeOut."]
    #[doc = "!              To get needed buffer size this function can be called with szProfileName==0 and cbSizeIn == 0."]
    #[doc = "!"]
    #[doc = "! WHEN TO USE: This API can be called at any time."]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\param [in]   cbSizeIn             Size of buffer allocated for default stereo profile name."]
    #[doc = "! \\param [out]  szProfileName        Default stereo profile name."]
    #[doc = "! \\param [out]  pcbSizeOut           Required buffer size."]
    #[doc = "!                     # ==0 - there is no default stereo profile name currently set"]
    #[doc = "!                     # !=0 - size of buffer required for currently set default stereo profile name including trailing '0'."]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\return      This API can return any of the error codes enumerated in #NvAPI_Status."]
    #[doc = "!              Error codes specific to this API are described below."]
    #[doc = "!"]
    #[doc = "! \\retval      NVAPI_SUCCESS                                - Default stereo profile name has been copied into szProfileName."]
    #[doc = "! \\retval      NVAPI_DEFAULT_STEREO_PROFILE_IS_NOT_DEFINED  - There is no default stereo profile set at this time."]
    #[doc = "! \\retval      NVAPI_INVALID_ARGUMENT                       - pcbSizeOut == 0 or cbSizeIn >= *pcbSizeOut && szProfileName == 0"]
    #[doc = "! \\retval      NVAPI_INSUFFICIENT_BUFFER                    - cbSizeIn < *pcbSizeOut"]
    #[doc = "!"]
    #[doc = "! \\ingroup stereoapi"]
    #[doc = ""]
    pub fn NvAPI_Stereo_GetDefaultProfile(
        cbSizeIn: NvU32,
        szProfileName: *mut ::std::os::raw::c_char,
        pcbSizeOut: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function initializes the NvAPI library (if not already initialized) but always increments the ref-counter."]
    #[doc = "! This must be called before calling other NvAPI_ functions."]
    #[doc = "! Note: It is now mandatory to call NvAPI_Initialize before calling any other NvAPI."]
    #[doc = "! NvAPI_Unload should be called to unload the NVAPI Library."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\return      This API can return any of the error codes enumerated in #NvAPI_Status. If there are return error codes with"]
    #[doc = "!              specific meaning for this API, they are listed below."]
    #[doc = "! \\retval      NVAPI_LIBRARY_NOT_FOUND  Failed to load the NVAPI support library"]
    #[doc = "! \\sa nvapistatus"]
    #[doc = "! \\ingroup nvapifunctions"]
    #[doc = ""]
    pub fn NvAPI_Initialize() -> NvAPI_Status;
}
extern "C" {
    #[doc = "!   DESCRIPTION: Decrements the ref-counter and when it reaches ZERO, unloads NVAPI library."]
    #[doc = "!                This must be called in pairs with NvAPI_Initialize."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "!        If the client wants unload functionality, it is recommended to always call NvAPI_Initialize and NvAPI_Unload in pairs."]
    #[doc = "!"]
    #[doc = "!  Unloading NvAPI library is not supported when the library is in a resource locked state."]
    #[doc = "!  Some functions in the NvAPI library initiates an operation or allocates certain resources"]
    #[doc = "!  and there are corresponding functions available, to complete the operation or free the"]
    #[doc = "!  allocated resources. All such function pairs are designed to prevent unloading NvAPI library."]
    #[doc = "!"]
    #[doc = "!  For example, if NvAPI_Unload is called after NvAPI_XXX which locks a resource, it fails with"]
    #[doc = "!  NVAPI_ERROR. Developers need to call the corresponding NvAPI_YYY to unlock the resources,"]
    #[doc = "!  before calling NvAPI_Unload again."]
    #[doc = "!"]
    #[doc = "! \\return      This API can return any of the error codes enumerated in #NvAPI_Status. If there are return error codes with"]
    #[doc = "!              specific meaning for this API, they are listed below."]
    #[doc = "! \\retval      NVAPI_API_IN_USE       Atleast an API is still being called hence cannot unload requested driver."]
    #[doc = "!"]
    #[doc = "! \\ingroup nvapifunctions"]
    #[doc = ""]
    pub fn NvAPI_Unload() -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function converts an NvAPI error code into a null terminated string."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\param nr      The error code to convert"]
    #[doc = "! \\param szDesc  The string corresponding to the error code"]
    #[doc = "!"]
    #[doc = "! \\return NULL terminated string (always, never NULL)"]
    #[doc = "! \\ingroup nvapifunctions"]
    #[doc = ""]
    pub fn NvAPI_GetErrorMessage(
        nr: NvAPI_Status,
        szDesc: *mut ::std::os::raw::c_char,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns a string describing the version of the NvAPI library."]
    #[doc = "!               The contents of the string are human readable.  Do not assume a fixed"]
    #[doc = "!                format."]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\param  szDesc User readable string giving NvAPI version information"]
    #[doc = "!"]
    #[doc = "! \\return See \\ref nvapistatus for the list of possible return values."]
    #[doc = "! \\ingroup nvapifunctions"]
    #[doc = ""]
    pub fn NvAPI_GetInterfaceVersionString(szDesc: *mut ::std::os::raw::c_char) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns a string describing the version of the NvAPI library."]
    #[doc = "!               The contents of the string are human readable.  Do not assume a fixed  format."]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 450"]
    #[doc = "!"]
    #[doc = "! \\param  szDesc User readable string giving NvAPI version information"]
    #[doc = "!"]
    #[doc = "! \\return See \\ref nvapistatus for the list of possible return values."]
    #[doc = "! \\ingroup nvapifunctions"]
    #[doc = ""]
    pub fn NvAPI_GetInterfaceVersionStringEx(szDesc: *mut ::std::os::raw::c_char) -> NvAPI_Status;
}
pub const _NV_DP_LINK_RATE_NV_DP_1_62GBPS: _NV_DP_LINK_RATE = 6;
pub const _NV_DP_LINK_RATE_NV_DP_2_70GBPS: _NV_DP_LINK_RATE = 10;
pub const _NV_DP_LINK_RATE_NV_DP_5_40GBPS: _NV_DP_LINK_RATE = 20;
pub const _NV_DP_LINK_RATE_NV_DP_8_10GBPS: _NV_DP_LINK_RATE = 30;
pub const _NV_DP_LINK_RATE_NV_EDP_2_16GBPS: _NV_DP_LINK_RATE = 8;
pub const _NV_DP_LINK_RATE_NV_EDP_2_43GBPS: _NV_DP_LINK_RATE = 9;
pub const _NV_DP_LINK_RATE_NV_EDP_3_24GBPS: _NV_DP_LINK_RATE = 12;
pub const _NV_DP_LINK_RATE_NV_EDP_4_32GBPS: _NV_DP_LINK_RATE = 16;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_LINK_RATE = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_LINK_RATE as NV_DP_LINK_RATE;
pub const _NV_DP_LANE_COUNT_NV_DP_1_LANE: _NV_DP_LANE_COUNT = 1;
pub const _NV_DP_LANE_COUNT_NV_DP_2_LANE: _NV_DP_LANE_COUNT = 2;
pub const _NV_DP_LANE_COUNT_NV_DP_4_LANE: _NV_DP_LANE_COUNT = 4;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_LANE_COUNT = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_LANE_COUNT as NV_DP_LANE_COUNT;
pub const _NV_DP_COLOR_FORMAT_NV_DP_COLOR_FORMAT_RGB: _NV_DP_COLOR_FORMAT = 0;
pub const _NV_DP_COLOR_FORMAT_NV_DP_COLOR_FORMAT_YCbCr422: _NV_DP_COLOR_FORMAT = 1;
pub const _NV_DP_COLOR_FORMAT_NV_DP_COLOR_FORMAT_YCbCr444: _NV_DP_COLOR_FORMAT = 2;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_COLOR_FORMAT = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_COLOR_FORMAT as NV_DP_COLOR_FORMAT;
pub const _NV_DP_COLORIMETRY_NV_DP_COLORIMETRY_RGB: _NV_DP_COLORIMETRY = 0;
pub const _NV_DP_COLORIMETRY_NV_DP_COLORIMETRY_YCbCr_ITU601: _NV_DP_COLORIMETRY = 1;
pub const _NV_DP_COLORIMETRY_NV_DP_COLORIMETRY_YCbCr_ITU709: _NV_DP_COLORIMETRY = 2;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_COLORIMETRY = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_COLORIMETRY as NV_DP_COLORIMETRY;
pub const _NV_DP_DYNAMIC_RANGE_NV_DP_DYNAMIC_RANGE_VESA: _NV_DP_DYNAMIC_RANGE = 0;
pub const _NV_DP_DYNAMIC_RANGE_NV_DP_DYNAMIC_RANGE_CEA: _NV_DP_DYNAMIC_RANGE = 1;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_DYNAMIC_RANGE = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_DYNAMIC_RANGE as NV_DP_DYNAMIC_RANGE;
pub const _NV_DP_BPC_NV_DP_BPC_DEFAULT: _NV_DP_BPC = 0;
pub const _NV_DP_BPC_NV_DP_BPC_6: _NV_DP_BPC = 1;
pub const _NV_DP_BPC_NV_DP_BPC_8: _NV_DP_BPC = 2;
pub const _NV_DP_BPC_NV_DP_BPC_10: _NV_DP_BPC = 3;
pub const _NV_DP_BPC_NV_DP_BPC_12: _NV_DP_BPC = 4;
pub const _NV_DP_BPC_NV_DP_BPC_16: _NV_DP_BPC = 5;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub type _NV_DP_BPC = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PORT_INFO."]
pub use self::_NV_DP_BPC as NV_DP_BPC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_EDID_V1 {
    pub version: NvU32,
    pub EDID_Data: [NvU8; 256usize],
}
#[test]
fn bindgen_test_layout_NV_EDID_V1() {
    assert_eq!(
        ::std::mem::size_of::<NV_EDID_V1>(),
        260usize,
        concat!("Size of: ", stringify!(NV_EDID_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_EDID_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_EDID_V1))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V1),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_EDID_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EDID_Data) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V1),
                "::",
                stringify!(EDID_Data)
            )
        );
    }
    test_field_EDID_Data();
}
impl Default for NV_EDID_V1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! Used in NvAPI_GPU_GetEDID()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_EDID_V2 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    pub EDID_Data: [NvU8; 256usize],
    pub sizeofEDID: NvU32,
}
#[test]
fn bindgen_test_layout_NV_EDID_V2() {
    assert_eq!(
        ::std::mem::size_of::<NV_EDID_V2>(),
        264usize,
        concat!("Size of: ", stringify!(NV_EDID_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_EDID_V2>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_EDID_V2))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V2),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_EDID_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EDID_Data) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V2),
                "::",
                stringify!(EDID_Data)
            )
        );
    }
    test_field_EDID_Data();
    fn test_field_sizeofEDID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sizeofEDID) as usize - ptr as usize
            },
            260usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V2),
                "::",
                stringify!(sizeofEDID)
            )
        );
    }
    test_field_sizeofEDID();
}
impl Default for NV_EDID_V2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! Used in NvAPI_GPU_GetEDID()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_EDID_V3 {
    #[doc = "!< Structure version"]
    pub version: NvU32,
    pub EDID_Data: [NvU8; 256usize],
    pub sizeofEDID: NvU32,
    #[doc = "!< ID which always returned in a monotonically increasing counter."]
    #[doc = "!< Across a split-EDID read we need to verify that all calls returned the same edidId."]
    #[doc = "!< This counter is incremented if we get the updated EDID."]
    pub edidId: NvU32,
    #[doc = "!< Which 256-byte page of the EDID we want to read. Start at 0."]
    #[doc = "!< If the read succeeds with edidSize > NV_EDID_DATA_SIZE,"]
    #[doc = "!< call back again with offset+256 until we have read the entire buffer"]
    pub offset: NvU32,
}
#[test]
fn bindgen_test_layout_NV_EDID_V3() {
    assert_eq!(
        ::std::mem::size_of::<NV_EDID_V3>(),
        272usize,
        concat!("Size of: ", stringify!(NV_EDID_V3))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_EDID_V3>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_EDID_V3))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V3),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_EDID_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EDID_Data) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V3),
                "::",
                stringify!(EDID_Data)
            )
        );
    }
    test_field_EDID_Data();
    fn test_field_sizeofEDID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sizeofEDID) as usize - ptr as usize
            },
            260usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V3),
                "::",
                stringify!(sizeofEDID)
            )
        );
    }
    test_field_sizeofEDID();
    fn test_field_edidId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).edidId) as usize - ptr as usize
            },
            264usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V3),
                "::",
                stringify!(edidId)
            )
        );
    }
    test_field_edidId();
    fn test_field_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_EDID_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
            },
            268usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_EDID_V3),
                "::",
                stringify!(offset)
            )
        );
    }
    test_field_offset();
}
impl Default for NV_EDID_V3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! Used in NvAPI_GPU_GetEDID()"]
pub type NV_EDID = NV_EDID_V3;
extern "C" {
    #[doc = "! \\ingroup gpu"]
    pub fn NvAPI_GPU_GetEDID(
        hPhysicalGpu: NvPhysicalGpuHandle,
        displayOutputId: NvU32,
        pEDID: *mut NV_EDID,
    ) -> NvAPI_Status;
}
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_VGA_15_PIN: _NV_GPU_CONNECTOR_TYPE = 0;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_COMPOSITE: _NV_GPU_CONNECTOR_TYPE = 16;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_SVIDEO: _NV_GPU_CONNECTOR_TYPE = 17;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_HDTV_COMPONENT: _NV_GPU_CONNECTOR_TYPE = 19;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_SCART: _NV_GPU_CONNECTOR_TYPE = 20;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_COMPOSITE_SCART_ON_EIAJ4120:
    _NV_GPU_CONNECTOR_TYPE = 22;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_TV_HDTV_EIAJ4120: _NV_GPU_CONNECTOR_TYPE = 23;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_PC_POD_HDTV_YPRPB: _NV_GPU_CONNECTOR_TYPE = 24;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_PC_POD_SVIDEO: _NV_GPU_CONNECTOR_TYPE = 25;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_PC_POD_COMPOSITE: _NV_GPU_CONNECTOR_TYPE = 26;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DVI_I_TV_SVIDEO: _NV_GPU_CONNECTOR_TYPE = 32;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DVI_I_TV_COMPOSITE: _NV_GPU_CONNECTOR_TYPE =
    33;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DVI_I: _NV_GPU_CONNECTOR_TYPE = 48;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DVI_D: _NV_GPU_CONNECTOR_TYPE = 49;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_ADC: _NV_GPU_CONNECTOR_TYPE = 50;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_LFH_DVI_I_1: _NV_GPU_CONNECTOR_TYPE = 56;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_LFH_DVI_I_2: _NV_GPU_CONNECTOR_TYPE = 57;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_SPWG: _NV_GPU_CONNECTOR_TYPE = 64;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_OEM: _NV_GPU_CONNECTOR_TYPE = 65;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DISPLAYPORT_EXTERNAL: _NV_GPU_CONNECTOR_TYPE =
    70;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DISPLAYPORT_INTERNAL: _NV_GPU_CONNECTOR_TYPE =
    71;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_DISPLAYPORT_MINI_EXT: _NV_GPU_CONNECTOR_TYPE =
    72;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_HDMI_A: _NV_GPU_CONNECTOR_TYPE = 97;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_HDMI_C_MINI: _NV_GPU_CONNECTOR_TYPE = 99;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_LFH_DISPLAYPORT_1: _NV_GPU_CONNECTOR_TYPE =
    100;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_LFH_DISPLAYPORT_2: _NV_GPU_CONNECTOR_TYPE =
    101;
#[doc = "!< Deprecated."]
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_VIRTUAL_WFD: _NV_GPU_CONNECTOR_TYPE = 112;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_USB_C: _NV_GPU_CONNECTOR_TYPE = 113;
pub const _NV_GPU_CONNECTOR_TYPE_NVAPI_GPU_CONNECTOR_UNKNOWN: _NV_GPU_CONNECTOR_TYPE = -1;
#[doc = "! \\ingroup gpu"]
#[doc = "! Used in NV_GPU_CONNECTOR_DATA"]
pub type _NV_GPU_CONNECTOR_TYPE = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpu"]
#[doc = "! Used in NV_GPU_CONNECTOR_DATA"]
pub use self::_NV_GPU_CONNECTOR_TYPE as NV_GPU_CONNECTOR_TYPE;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_NONE: _NV_DISPLAY_TV_FORMAT = 0;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_NTSCM: _NV_DISPLAY_TV_FORMAT = 1;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_NTSCJ: _NV_DISPLAY_TV_FORMAT = 2;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_PALM: _NV_DISPLAY_TV_FORMAT = 4;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_PALBDGH: _NV_DISPLAY_TV_FORMAT = 8;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_PALN: _NV_DISPLAY_TV_FORMAT = 16;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_PALNC: _NV_DISPLAY_TV_FORMAT = 32;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_576i: _NV_DISPLAY_TV_FORMAT = 256;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_480i: _NV_DISPLAY_TV_FORMAT = 512;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_ED_480p: _NV_DISPLAY_TV_FORMAT = 1024;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_ED_576p: _NV_DISPLAY_TV_FORMAT = 2048;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_720p: _NV_DISPLAY_TV_FORMAT = 4096;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080i: _NV_DISPLAY_TV_FORMAT = 8192;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080p: _NV_DISPLAY_TV_FORMAT = 16384;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_720p50: _NV_DISPLAY_TV_FORMAT = 32768;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080p24: _NV_DISPLAY_TV_FORMAT = 65536;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080i50: _NV_DISPLAY_TV_FORMAT = 131072;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_1080p50: _NV_DISPLAY_TV_FORMAT = 262144;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp30: _NV_DISPLAY_TV_FORMAT = 524288;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp30_3840: _NV_DISPLAY_TV_FORMAT = 524288;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp25: _NV_DISPLAY_TV_FORMAT = 1048576;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp25_3840: _NV_DISPLAY_TV_FORMAT =
    1048576;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24: _NV_DISPLAY_TV_FORMAT = 2097152;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24_3840: _NV_DISPLAY_TV_FORMAT =
    2097152;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24_SMPTE: _NV_DISPLAY_TV_FORMAT =
    4194304;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp50_3840: _NV_DISPLAY_TV_FORMAT =
    8388608;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp60_3840: _NV_DISPLAY_TV_FORMAT =
    9437184;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp30_4096: _NV_DISPLAY_TV_FORMAT =
    10485760;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp25_4096: _NV_DISPLAY_TV_FORMAT =
    11534336;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24_4096: _NV_DISPLAY_TV_FORMAT =
    12582912;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp50_4096: _NV_DISPLAY_TV_FORMAT =
    13631488;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp60_4096: _NV_DISPLAY_TV_FORMAT =
    14680064;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp24_7680: _NV_DISPLAY_TV_FORMAT =
    16777216;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp25_7680: _NV_DISPLAY_TV_FORMAT =
    33554432;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp30_7680: _NV_DISPLAY_TV_FORMAT =
    67108864;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp48_7680: _NV_DISPLAY_TV_FORMAT =
    134217728;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp50_7680: _NV_DISPLAY_TV_FORMAT =
    150994944;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp60_7680: _NV_DISPLAY_TV_FORMAT =
    167772160;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp100_7680: _NV_DISPLAY_TV_FORMAT =
    184549376;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_8Kp120_7680: _NV_DISPLAY_TV_FORMAT =
    201326592;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp48_3840: _NV_DISPLAY_TV_FORMAT =
    218103808;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp48_4096: _NV_DISPLAY_TV_FORMAT =
    234881024;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp100_4096: _NV_DISPLAY_TV_FORMAT =
    251658240;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp100_3840: _NV_DISPLAY_TV_FORMAT =
    268435456;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp120_4096: _NV_DISPLAY_TV_FORMAT =
    285212672;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp120_3840: _NV_DISPLAY_TV_FORMAT =
    301989888;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp100_5120: _NV_DISPLAY_TV_FORMAT =
    318767104;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp120_5120: _NV_DISPLAY_TV_FORMAT =
    335544320;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp24_5120: _NV_DISPLAY_TV_FORMAT =
    352321536;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp25_5120: _NV_DISPLAY_TV_FORMAT =
    369098752;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp30_5120: _NV_DISPLAY_TV_FORMAT =
    385875968;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp48_5120: _NV_DISPLAY_TV_FORMAT =
    402653184;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp50_5120: _NV_DISPLAY_TV_FORMAT =
    419430400;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_4Kp60_5120: _NV_DISPLAY_TV_FORMAT =
    536870912;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp24_10240: _NV_DISPLAY_TV_FORMAT =
    553648128;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp25_10240: _NV_DISPLAY_TV_FORMAT =
    570425344;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp30_10240: _NV_DISPLAY_TV_FORMAT =
    587202560;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp48_10240: _NV_DISPLAY_TV_FORMAT =
    603979776;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp50_10240: _NV_DISPLAY_TV_FORMAT =
    620756992;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp60_10240: _NV_DISPLAY_TV_FORMAT =
    637534208;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp100_10240: _NV_DISPLAY_TV_FORMAT =
    654311424;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_UHD_10Kp120_10240: _NV_DISPLAY_TV_FORMAT =
    671088640;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_SD_OTHER: _NV_DISPLAY_TV_FORMAT = 805306368;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_ED_OTHER: _NV_DISPLAY_TV_FORMAT = 1073741824;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_HD_OTHER: _NV_DISPLAY_TV_FORMAT = 1342177280;
pub const _NV_DISPLAY_TV_FORMAT_NV_DISPLAY_TV_FORMAT_ANY: _NV_DISPLAY_TV_FORMAT = -2147483648;
#[doc = "! \\ingroup tvapi"]
#[doc = "! Used in NV_DISPLAY_TV_OUTPUT_INFO"]
pub type _NV_DISPLAY_TV_FORMAT = ::std::os::raw::c_int;
#[doc = "! \\ingroup tvapi"]
#[doc = "! Used in NV_DISPLAY_TV_OUTPUT_INFO"]
pub use self::_NV_DISPLAY_TV_FORMAT as NV_DISPLAY_TV_FORMAT;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_STANDARD: _NV_TARGET_VIEW_MODE = 0;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_CLONE: _NV_TARGET_VIEW_MODE = 1;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_HSPAN: _NV_TARGET_VIEW_MODE = 2;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_VSPAN: _NV_TARGET_VIEW_MODE = 3;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_DUALVIEW: _NV_TARGET_VIEW_MODE = 4;
pub const _NV_TARGET_VIEW_MODE_NV_VIEW_MODE_MULTIVIEW: _NV_TARGET_VIEW_MODE = 5;
#[doc = "! Used in NvAPI_SetView()."]
pub type _NV_TARGET_VIEW_MODE = ::std::os::raw::c_int;
#[doc = "! Used in NvAPI_SetView()."]
pub use self::_NV_TARGET_VIEW_MODE as NV_TARGET_VIEW_MODE;
#[doc = "!< No change"]
pub const _NV_SCALING_NV_SCALING_DEFAULT: _NV_SCALING = 0;
#[doc = "!< Balanced  - Full Screen"]
pub const _NV_SCALING_NV_SCALING_GPU_SCALING_TO_CLOSEST: _NV_SCALING = 1;
#[doc = "!< Force GPU - Full Screen"]
pub const _NV_SCALING_NV_SCALING_GPU_SCALING_TO_NATIVE: _NV_SCALING = 2;
#[doc = "!< Force GPU - Centered\\No Scaling"]
pub const _NV_SCALING_NV_SCALING_GPU_SCANOUT_TO_NATIVE: _NV_SCALING = 3;
#[doc = "!< Force GPU - Aspect Ratio"]
pub const _NV_SCALING_NV_SCALING_GPU_SCALING_TO_ASPECT_SCANOUT_TO_NATIVE: _NV_SCALING = 5;
#[doc = "!< Balanced  - Aspect Ratio"]
pub const _NV_SCALING_NV_SCALING_GPU_SCALING_TO_ASPECT_SCANOUT_TO_CLOSEST: _NV_SCALING = 6;
#[doc = "!< Balanced  - Centered\\No Scaling"]
pub const _NV_SCALING_NV_SCALING_GPU_SCANOUT_TO_CLOSEST: _NV_SCALING = 7;
#[doc = "!< Force GPU - Integer Scaling"]
pub const _NV_SCALING_NV_SCALING_GPU_INTEGER_ASPECT_SCALING: _NV_SCALING = 8;
pub const _NV_SCALING_NV_SCALING_MONITOR_SCALING: _NV_SCALING = 1;
pub const _NV_SCALING_NV_SCALING_ADAPTER_SCALING: _NV_SCALING = 2;
pub const _NV_SCALING_NV_SCALING_CENTERED: _NV_SCALING = 3;
pub const _NV_SCALING_NV_SCALING_ASPECT_SCALING: _NV_SCALING = 5;
#[doc = "!< For future use"]
pub const _NV_SCALING_NV_SCALING_CUSTOMIZED: _NV_SCALING = 255;
#[doc = "! Scaling modes - used in NvAPI_SetViewEx()."]
#[doc = "! \\ingroup dispcontrol"]
pub type _NV_SCALING = ::std::os::raw::c_int;
#[doc = "! Scaling modes - used in NvAPI_SetViewEx()."]
#[doc = "! \\ingroup dispcontrol"]
pub use self::_NV_SCALING as NV_SCALING;
pub const _NV_ROTATE_NV_ROTATE_0: _NV_ROTATE = 0;
pub const _NV_ROTATE_NV_ROTATE_90: _NV_ROTATE = 1;
pub const _NV_ROTATE_NV_ROTATE_180: _NV_ROTATE = 2;
pub const _NV_ROTATE_NV_ROTATE_270: _NV_ROTATE = 3;
pub const _NV_ROTATE_NV_ROTATE_IGNORED: _NV_ROTATE = 4;
#[doc = "! \\ingroup dispcontrol"]
pub type _NV_ROTATE = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
pub use self::_NV_ROTATE as NV_ROTATE;
#[doc = "!< unknown. Driver will choose one as following value."]
pub const _NV_FORMAT_NV_FORMAT_UNKNOWN: _NV_FORMAT = 0;
#[doc = "!< for 8bpp mode"]
pub const _NV_FORMAT_NV_FORMAT_P8: _NV_FORMAT = 41;
#[doc = "!< for 16bpp mode"]
pub const _NV_FORMAT_NV_FORMAT_R5G6B5: _NV_FORMAT = 23;
#[doc = "!< for 32bpp mode"]
pub const _NV_FORMAT_NV_FORMAT_A8R8G8B8: _NV_FORMAT = 21;
#[doc = "!< for 64bpp(floating point) mode."]
pub const _NV_FORMAT_NV_FORMAT_A16B16G16R16F: _NV_FORMAT = 113;
#[doc = "! Color formats- used in NvAPI_SetViewEx()."]
#[doc = "! \\ingroup dispcontrol"]
pub type _NV_FORMAT = ::std::os::raw::c_int;
#[doc = "! Color formats- used in NvAPI_SetViewEx()."]
#[doc = "! \\ingroup dispcontrol"]
pub use self::_NV_FORMAT as NV_FORMAT;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_VIEWPORTF {
    #[doc = "!<  x-coordinate of the viewport top-left point"]
    pub x: f32,
    #[doc = "!<  y-coordinate of the viewport top-left point"]
    pub y: f32,
    #[doc = "!<  Width of the viewport"]
    pub w: f32,
    #[doc = "!<  Height of the viewport"]
    pub h: f32,
}
#[test]
fn bindgen_test_layout_NV_VIEWPORTF() {
    assert_eq!(
        ::std::mem::size_of::<NV_VIEWPORTF>(),
        16usize,
        concat!("Size of: ", stringify!(NV_VIEWPORTF))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_VIEWPORTF>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_VIEWPORTF))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEWPORTF>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEWPORTF),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEWPORTF>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEWPORTF),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
    fn test_field_w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEWPORTF>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEWPORTF),
                "::",
                stringify!(w)
            )
        );
    }
    test_field_w();
    fn test_field_h() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEWPORTF>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEWPORTF),
                "::",
                stringify!(h)
            )
        );
    }
    test_field_h();
}
#[doc = "!< get the current timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_CURRENT: _NV_TIMING_OVERRIDE = 0;
#[doc = "!< the timing the driver will use based the current policy"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_AUTO: _NV_TIMING_OVERRIDE = 1;
#[doc = "!< EDID timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_EDID: _NV_TIMING_OVERRIDE = 2;
#[doc = "!< VESA DMT timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_DMT: _NV_TIMING_OVERRIDE = 3;
#[doc = "!< VESA DMT timing with reduced blanking"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_DMT_RB: _NV_TIMING_OVERRIDE = 4;
#[doc = "!< VESA CVT timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_CVT: _NV_TIMING_OVERRIDE = 5;
#[doc = "!< VESA CVT timing with reduced blanking"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_CVT_RB: _NV_TIMING_OVERRIDE = 6;
#[doc = "!< VESA GTF timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_GTF: _NV_TIMING_OVERRIDE = 7;
#[doc = "!< EIA 861x pre-defined timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_EIA861: _NV_TIMING_OVERRIDE = 8;
#[doc = "!< analog SD/HDTV timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_ANALOG_TV: _NV_TIMING_OVERRIDE = 9;
#[doc = "!< NV custom timings"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_CUST: _NV_TIMING_OVERRIDE = 10;
#[doc = "!< NV pre-defined timing (basically the PsF timings)"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_NV_PREDEFINED: _NV_TIMING_OVERRIDE = 11;
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_NV_PSF: _NV_TIMING_OVERRIDE = 11;
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_NV_ASPR: _NV_TIMING_OVERRIDE = 12;
#[doc = "!< Override for SDI timing"]
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVERRIDE_SDI: _NV_TIMING_OVERRIDE = 13;
pub const _NV_TIMING_OVERRIDE_NV_TIMING_OVRRIDE_MAX: _NV_TIMING_OVERRIDE = 14;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! The timing override is not supported yet; must be set to _AUTO. \\n"]
pub type _NV_TIMING_OVERRIDE = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! The timing override is not supported yet; must be set to _AUTO. \\n"]
pub use self::_NV_TIMING_OVERRIDE as NV_TIMING_OVERRIDE;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "!  NVIDIA-specific timing extras \\n"]
#[doc = "! Used in NV_TIMING."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagNV_TIMINGEXT {
    #[doc = "!< Reserved for NVIDIA hardware-based enhancement, such as double-scan."]
    pub flag: NvU32,
    #[doc = "!< Logical refresh rate to present"]
    pub rr: NvU16,
    #[doc = "!< Physical vertical refresh rate in 0.001Hz"]
    pub rrx1k: NvU32,
    #[doc = "!< Display aspect ratio Hi(aspect):horizontal-aspect, Low(aspect):vertical-aspect"]
    pub aspect: NvU32,
    #[doc = "!< Bit-wise pixel repetition factor: 0x1:no pixel repetition; 0x2:each pixel repeats twice horizontally,.."]
    pub rep: NvU16,
    #[doc = "!< Timing standard"]
    pub status: NvU32,
    #[doc = "!< Timing name"]
    pub name: [NvU8; 40usize],
}
#[test]
fn bindgen_test_layout_tagNV_TIMINGEXT() {
    assert_eq!(
        ::std::mem::size_of::<tagNV_TIMINGEXT>(),
        64usize,
        concat!("Size of: ", stringify!(tagNV_TIMINGEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<tagNV_TIMINGEXT>(),
        4usize,
        concat!("Alignment of ", stringify!(tagNV_TIMINGEXT))
    );
    fn test_field_flag() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tagNV_TIMINGEXT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(tagNV_TIMINGEXT),
                "::",
                stringify!(flag)
            )
        );
    }
    test_field_flag();
    fn test_field_rr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tagNV_TIMINGEXT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rr) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(tagNV_TIMINGEXT),
                "::",
                stringify!(rr)
            )
        );
    }
    test_field_rr();
    fn test_field_rrx1k() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tagNV_TIMINGEXT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rrx1k) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(tagNV_TIMINGEXT),
                "::",
                stringify!(rrx1k)
            )
        );
    }
    test_field_rrx1k();
    fn test_field_aspect() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tagNV_TIMINGEXT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).aspect) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(tagNV_TIMINGEXT),
                "::",
                stringify!(aspect)
            )
        );
    }
    test_field_aspect();
    fn test_field_rep() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tagNV_TIMINGEXT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rep) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(tagNV_TIMINGEXT),
                "::",
                stringify!(rep)
            )
        );
    }
    test_field_rep();
    fn test_field_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tagNV_TIMINGEXT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(tagNV_TIMINGEXT),
                "::",
                stringify!(status)
            )
        );
    }
    test_field_status();
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tagNV_TIMINGEXT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(tagNV_TIMINGEXT),
                "::",
                stringify!(name)
            )
        );
    }
    test_field_name();
}
impl Default for tagNV_TIMINGEXT {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! \\ingroup dispcontrol"]
#[doc = "!  NVIDIA-specific timing extras \\n"]
#[doc = "! Used in NV_TIMING."]
pub type NV_TIMINGEXT = tagNV_TIMINGEXT;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! The very basic timing structure based on the VESA standard:"]
#[doc = "! \\code"]
#[doc = "!            |<----------------------------htotal--------------------------->|"]
#[doc = "!             ---------\"active\" video-------->|<-------blanking------>|<-----"]
#[doc = "!            |<-------hvisible-------->|<-hb->|<-hfp->|<-hsw->|<-hbp->|<-hb->|"]
#[doc = "! --------- -+-------------------------+      |       |       |       |      |"]
#[doc = "!   A      A |                         |      |       |       |       |      |"]
#[doc = "!   :      : |                         |      |       |       |       |      |"]
#[doc = "!   :      : |                         |      |       |       |       |      |"]
#[doc = "!   :vertical|    addressable video    |      |       |       |       |      |"]
#[doc = "!   : visible|                         |      |       |       |       |      |"]
#[doc = "!   :      : |                         |      |       |       |       |      |"]
#[doc = "!   :      : |                         |      |       |       |       |      |"]
#[doc = "! vertical V |                         |      |       |       |       |      |"]
#[doc = "!  total   --+-------------------------+      |       |       |       |      |"]
#[doc = "!   :      vb         border                  |       |       |       |      |"]
#[doc = "!   :      -----------------------------------+       |       |       |      |"]
#[doc = "!   :      vfp        front porch                     |       |       |      |"]
#[doc = "!   :      -------------------------------------------+       |       |      |"]
#[doc = "!   :      vsw        sync width                              |       |      |"]
#[doc = "!   :      ---------------------------------------------------+       |      |"]
#[doc = "!   :      vbp        back porch                                      |      |"]
#[doc = "!   :      -----------------------------------------------------------+      |"]
#[doc = "!   V      vb         border                                                 |"]
#[doc = "! ---------------------------------------------------------------------------+"]
#[doc = "! \\endcode"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_TIMING {
    #[doc = "!< horizontal visible"]
    pub HVisible: NvU16,
    #[doc = "!< horizontal border"]
    pub HBorder: NvU16,
    #[doc = "!< horizontal front porch"]
    pub HFrontPorch: NvU16,
    #[doc = "!< horizontal sync width"]
    pub HSyncWidth: NvU16,
    #[doc = "!< horizontal total"]
    pub HTotal: NvU16,
    #[doc = "!< horizontal sync polarity: 1-negative, 0-positive"]
    pub HSyncPol: NvU8,
    #[doc = "!< vertical visible"]
    pub VVisible: NvU16,
    #[doc = "!< vertical border"]
    pub VBorder: NvU16,
    #[doc = "!< vertical front porch"]
    pub VFrontPorch: NvU16,
    #[doc = "!< vertical sync width"]
    pub VSyncWidth: NvU16,
    #[doc = "!< vertical total"]
    pub VTotal: NvU16,
    #[doc = "!< vertical sync polarity: 1-negative, 0-positive"]
    pub VSyncPol: NvU8,
    #[doc = "!< 1-interlaced, 0-progressive"]
    pub interlaced: NvU16,
    #[doc = "!< pixel clock in 10 kHz"]
    pub pclk: NvU32,
    pub etc: NV_TIMINGEXT,
}
#[test]
fn bindgen_test_layout__NV_TIMING() {
    assert_eq!(
        ::std::mem::size_of::<_NV_TIMING>(),
        96usize,
        concat!("Size of: ", stringify!(_NV_TIMING))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_TIMING>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_TIMING))
    );
    fn test_field_HVisible() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).HVisible) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(HVisible)
            )
        );
    }
    test_field_HVisible();
    fn test_field_HBorder() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).HBorder) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(HBorder)
            )
        );
    }
    test_field_HBorder();
    fn test_field_HFrontPorch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).HFrontPorch) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(HFrontPorch)
            )
        );
    }
    test_field_HFrontPorch();
    fn test_field_HSyncWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).HSyncWidth) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(HSyncWidth)
            )
        );
    }
    test_field_HSyncWidth();
    fn test_field_HTotal() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).HTotal) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(HTotal)
            )
        );
    }
    test_field_HTotal();
    fn test_field_HSyncPol() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).HSyncPol) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(HSyncPol)
            )
        );
    }
    test_field_HSyncPol();
    fn test_field_VVisible() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VVisible) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(VVisible)
            )
        );
    }
    test_field_VVisible();
    fn test_field_VBorder() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VBorder) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(VBorder)
            )
        );
    }
    test_field_VBorder();
    fn test_field_VFrontPorch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VFrontPorch) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(VFrontPorch)
            )
        );
    }
    test_field_VFrontPorch();
    fn test_field_VSyncWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VSyncWidth) as usize - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(VSyncWidth)
            )
        );
    }
    test_field_VSyncWidth();
    fn test_field_VTotal() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VTotal) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(VTotal)
            )
        );
    }
    test_field_VTotal();
    fn test_field_VSyncPol() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VSyncPol) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(VSyncPol)
            )
        );
    }
    test_field_VSyncPol();
    fn test_field_interlaced() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).interlaced) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(interlaced)
            )
        );
    }
    test_field_interlaced();
    fn test_field_pclk() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pclk) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(pclk)
            )
        );
    }
    test_field_pclk();
    fn test_field_etc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_TIMING>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).etc) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_TIMING),
                "::",
                stringify!(etc)
            )
        );
    }
    test_field_etc();
}
impl Default for _NV_TIMING {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! The very basic timing structure based on the VESA standard:"]
#[doc = "! \\code"]
#[doc = "!            |<----------------------------htotal--------------------------->|"]
#[doc = "!             ---------\"active\" video-------->|<-------blanking------>|<-----"]
#[doc = "!            |<-------hvisible-------->|<-hb->|<-hfp->|<-hsw->|<-hbp->|<-hb->|"]
#[doc = "! --------- -+-------------------------+      |       |       |       |      |"]
#[doc = "!   A      A |                         |      |       |       |       |      |"]
#[doc = "!   :      : |                         |      |       |       |       |      |"]
#[doc = "!   :      : |                         |      |       |       |       |      |"]
#[doc = "!   :vertical|    addressable video    |      |       |       |       |      |"]
#[doc = "!   : visible|                         |      |       |       |       |      |"]
#[doc = "!   :      : |                         |      |       |       |       |      |"]
#[doc = "!   :      : |                         |      |       |       |       |      |"]
#[doc = "! vertical V |                         |      |       |       |       |      |"]
#[doc = "!  total   --+-------------------------+      |       |       |       |      |"]
#[doc = "!   :      vb         border                  |       |       |       |      |"]
#[doc = "!   :      -----------------------------------+       |       |       |      |"]
#[doc = "!   :      vfp        front porch                     |       |       |      |"]
#[doc = "!   :      -------------------------------------------+       |       |      |"]
#[doc = "!   :      vsw        sync width                              |       |      |"]
#[doc = "!   :      ---------------------------------------------------+       |      |"]
#[doc = "!   :      vbp        back porch                                      |      |"]
#[doc = "!   :      -----------------------------------------------------------+      |"]
#[doc = "!   V      vb         border                                                 |"]
#[doc = "! ---------------------------------------------------------------------------+"]
#[doc = "! \\endcode"]
pub type NV_TIMING = _NV_TIMING;
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NvAPI_SetView() and NvAPI_GetView()"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_VIEW_TARGET_INFO {
    #[doc = "!< (IN) structure version"]
    pub version: NvU32,
    #[doc = "!< (IN) target count"]
    pub count: NvU32,
    pub target: [NV_VIEW_TARGET_INFO__bindgen_ty_1; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_VIEW_TARGET_INFO__bindgen_ty_1 {
    #[doc = "!< (IN/OUT) Device mask"]
    pub deviceMask: NvU32,
    #[doc = "!< (IN/OUT) Source ID - values will be based on the number of heads exposed per GPU."]
    pub sourceId: NvU32,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_NV_VIEW_TARGET_INFO__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<NV_VIEW_TARGET_INFO__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(NV_VIEW_TARGET_INFO__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_VIEW_TARGET_INFO__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_VIEW_TARGET_INFO__bindgen_ty_1)
        )
    );
    fn test_field_deviceMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEW_TARGET_INFO__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deviceMask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEW_TARGET_INFO__bindgen_ty_1),
                "::",
                stringify!(deviceMask)
            )
        );
    }
    test_field_deviceMask();
    fn test_field_sourceId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEW_TARGET_INFO__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sourceId) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEW_TARGET_INFO__bindgen_ty_1),
                "::",
                stringify!(sourceId)
            )
        );
    }
    test_field_sourceId();
}
impl NV_VIEW_TARGET_INFO__bindgen_ty_1 {
    #[inline]
    pub fn bPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bInterlaced(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bInterlaced(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bGDIPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bGDIPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bForceModeSet(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bForceModeSet(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bPrimary: NvU32,
        bInterlaced: NvU32,
        bGDIPrimary: NvU32,
        bForceModeSet: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bPrimary: u32 = unsafe { ::std::mem::transmute(bPrimary) };
            bPrimary as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bInterlaced: u32 = unsafe { ::std::mem::transmute(bInterlaced) };
            bInterlaced as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bGDIPrimary: u32 = unsafe { ::std::mem::transmute(bGDIPrimary) };
            bGDIPrimary as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bForceModeSet: u32 = unsafe { ::std::mem::transmute(bForceModeSet) };
            bForceModeSet as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_NV_VIEW_TARGET_INFO() {
    assert_eq!(
        ::std::mem::size_of::<NV_VIEW_TARGET_INFO>(),
        32usize,
        concat!("Size of: ", stringify!(NV_VIEW_TARGET_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_VIEW_TARGET_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_VIEW_TARGET_INFO))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEW_TARGET_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEW_TARGET_INFO),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEW_TARGET_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEW_TARGET_INFO),
                "::",
                stringify!(count)
            )
        );
    }
    test_field_count();
    fn test_field_target() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_VIEW_TARGET_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).target) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_VIEW_TARGET_INFO),
                "::",
                stringify!(target)
            )
        );
    }
    test_field_target();
}
extern "C" {
    #[doc = "! \\ingroup dispcontrol"]
    pub fn NvAPI_SetView(
        hNvDisplay: NvDisplayHandle,
        pTargetInfo: *mut NV_VIEW_TARGET_INFO,
        targetView: NV_TARGET_VIEW_MODE,
    ) -> NvAPI_Status;
}
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NV_DISPLAY_PATH_INFO."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_PATH {
    #[doc = "!< (IN) Device mask"]
    pub deviceMask: NvU32,
    #[doc = "!< (IN) Values will be based on the number of heads exposed per GPU(0, 1?)"]
    pub sourceId: NvU32,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "!< (IN) Specify connector type. For TV only."]
    pub connector: NV_GPU_CONNECTOR_TYPE,
    #[doc = "!< (IN) Width of the mode"]
    pub width: NvU32,
    #[doc = "!< (IN) Height of the mode"]
    pub height: NvU32,
    #[doc = "!< (IN) Depth of the mode"]
    pub depth: NvU32,
    #[doc = "!<      Color format if it needs to be specified. Not used now."]
    pub colorFormat: NV_FORMAT,
    #[doc = "!< (IN) Rotation setting."]
    pub rotation: NV_ROTATE,
    #[doc = "!< (IN) Scaling setting"]
    pub scaling: NV_SCALING,
    #[doc = "!< (IN) Refresh rate of the mode"]
    pub refreshRate: NvU32,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "!< (IN) To choose the last TV format set this value to NV_DISPLAY_TV_FORMAT_NONE"]
    pub tvFormat: NV_DISPLAY_TV_FORMAT,
    #[doc = "!< (IN/OUT) X-offset of this display on the Windows desktop"]
    pub posx: NvU32,
    #[doc = "!< (IN/OUT) Y-offset of this display on the Windows desktop"]
    pub posy: NvU32,
    pub _bitfield_align_3: [u32; 0],
    pub _bitfield_3: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_PATH() {
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_PATH>(),
        64usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_PATH))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_PATH>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_DISPLAY_PATH))
    );
    fn test_field_deviceMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deviceMask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(deviceMask)
            )
        );
    }
    test_field_deviceMask();
    fn test_field_sourceId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sourceId) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(sourceId)
            )
        );
    }
    test_field_sourceId();
    fn test_field_connector() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).connector) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(connector)
            )
        );
    }
    test_field_connector();
    fn test_field_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(width)
            )
        );
    }
    test_field_width();
    fn test_field_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(height)
            )
        );
    }
    test_field_height();
    fn test_field_depth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(depth)
            )
        );
    }
    test_field_depth();
    fn test_field_colorFormat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).colorFormat) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(colorFormat)
            )
        );
    }
    test_field_colorFormat();
    fn test_field_rotation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(rotation)
            )
        );
    }
    test_field_rotation();
    fn test_field_scaling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).scaling) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(scaling)
            )
        );
    }
    test_field_scaling();
    fn test_field_refreshRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refreshRate) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(refreshRate)
            )
        );
    }
    test_field_refreshRate();
    fn test_field_tvFormat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tvFormat) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(tvFormat)
            )
        );
    }
    test_field_tvFormat();
    fn test_field_posx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).posx) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(posx)
            )
        );
    }
    test_field_posx();
    fn test_field_posy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).posy) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH),
                "::",
                stringify!(posy)
            )
        );
    }
    test_field_posy();
}
impl Default for NV_DISPLAY_PATH {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl NV_DISPLAY_PATH {
    #[inline]
    pub fn bPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(bPrimary: NvU32) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bPrimary: u32 = unsafe { ::std::mem::transmute(bPrimary) };
            bPrimary as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn interlaced(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_interlaced(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_2.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_2(interlaced: NvU32) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let interlaced: u32 = unsafe { ::std::mem::transmute(interlaced) };
            interlaced as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn bGDIPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bGDIPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_3.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bForceModeSet(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bForceModeSet(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_3.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bFocusDisplay(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bFocusDisplay(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_3.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn gpuId(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_3.get(3usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_gpuId(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_3.set(3usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_3(
        bGDIPrimary: NvU32,
        bForceModeSet: NvU32,
        bFocusDisplay: NvU32,
        gpuId: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bGDIPrimary: u32 = unsafe { ::std::mem::transmute(bGDIPrimary) };
            bGDIPrimary as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bForceModeSet: u32 = unsafe { ::std::mem::transmute(bForceModeSet) };
            bForceModeSet as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bFocusDisplay: u32 = unsafe { ::std::mem::transmute(bFocusDisplay) };
            bFocusDisplay as u64
        });
        __bindgen_bitfield_unit.set(3usize, 24u8, {
            let gpuId: u32 = unsafe { ::std::mem::transmute(gpuId) };
            gpuId as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NvAPI_SetViewEx() and NvAPI_GetViewEx()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_PATH_INFO_V3 {
    #[doc = "!< (IN) Structure version"]
    pub version: NvU32,
    #[doc = "!< (IN) Path count"]
    pub count: NvU32,
    pub path: [NV_DISPLAY_PATH; 2usize],
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_PATH_INFO_V3() {
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_PATH_INFO_V3>(),
        136usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_PATH_INFO_V3))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_PATH_INFO_V3>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_DISPLAY_PATH_INFO_V3))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH_INFO_V3),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH_INFO_V3),
                "::",
                stringify!(count)
            )
        );
    }
    test_field_count();
    fn test_field_path() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH_INFO_V3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH_INFO_V3),
                "::",
                stringify!(path)
            )
        );
    }
    test_field_path();
}
impl Default for NV_DISPLAY_PATH_INFO_V3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! \\ingroup dispcontrol"]
#[doc = "! Used in NvAPI_SetViewEx() and NvAPI_GetViewEx()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_PATH_INFO {
    #[doc = "!< (IN) Structure version"]
    pub version: NvU32,
    #[doc = "!< (IN) Path count"]
    pub count: NvU32,
    pub path: [NV_DISPLAY_PATH; 4usize],
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_PATH_INFO() {
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_PATH_INFO>(),
        264usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_PATH_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_PATH_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_DISPLAY_PATH_INFO))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH_INFO),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH_INFO),
                "::",
                stringify!(count)
            )
        );
    }
    test_field_count();
    fn test_field_path() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_PATH_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_PATH_INFO),
                "::",
                stringify!(path)
            )
        );
    }
    test_field_path();
}
impl Default for NV_DISPLAY_PATH_INFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    #[doc = "! \\ingroup dispcontrol"]
    pub fn NvAPI_SetViewEx(
        hNvDisplay: NvDisplayHandle,
        pPathInfo: *mut NV_DISPLAY_PATH_INFO,
        displayView: NV_TARGET_VIEW_MODE,
    ) -> NvAPI_Status;
}
#[doc = ""]
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _NV_POSITION {
    pub x: NvS32,
    pub y: NvS32,
}
#[test]
fn bindgen_test_layout__NV_POSITION() {
    assert_eq!(
        ::std::mem::size_of::<_NV_POSITION>(),
        8usize,
        concat!("Size of: ", stringify!(_NV_POSITION))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_POSITION>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_POSITION))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_POSITION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_POSITION),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_POSITION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_POSITION),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
}
#[doc = ""]
#[doc = "! \\ingroup dispcontrol"]
pub type NV_POSITION = _NV_POSITION;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _NV_RESOLUTION {
    pub width: NvU32,
    pub height: NvU32,
    pub colorDepth: NvU32,
}
#[test]
fn bindgen_test_layout__NV_RESOLUTION() {
    assert_eq!(
        ::std::mem::size_of::<_NV_RESOLUTION>(),
        12usize,
        concat!("Size of: ", stringify!(_NV_RESOLUTION))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_RESOLUTION>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_RESOLUTION))
    );
    fn test_field_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_RESOLUTION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_RESOLUTION),
                "::",
                stringify!(width)
            )
        );
    }
    test_field_width();
    fn test_field_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_RESOLUTION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_RESOLUTION),
                "::",
                stringify!(height)
            )
        );
    }
    test_field_height();
    fn test_field_colorDepth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_RESOLUTION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).colorDepth) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_RESOLUTION),
                "::",
                stringify!(colorDepth)
            )
        );
    }
    test_field_colorDepth();
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_RESOLUTION = _NV_RESOLUTION;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1 {
    pub version: NvU32,
    #[doc = "!< (IN) rotation setting."]
    pub rotation: NV_ROTATE,
    #[doc = "!< (IN) scaling setting."]
    pub scaling: NV_SCALING,
    #[doc = "!< (IN) Non-interlaced Refresh Rate of the mode, multiplied by 1000, 0 = ignored"]
    #[doc = "!< This is the value which driver reports to the OS."]
    pub refreshRate1K: NvU32,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "!< Specify connector type. For TV only, ignored if tvFormat == NV_DISPLAY_TV_FORMAT_NONE"]
    pub connector: NV_GPU_CONNECTOR_TYPE,
    #[doc = "!< (IN) to choose the last TV format set this value to NV_DISPLAY_TV_FORMAT_NONE"]
    #[doc = "!< In case of NvAPI_DISP_GetDisplayConfig(), this field will indicate the currently applied TV format;"]
    #[doc = "!< if no TV format is applied, this field will have NV_DISPLAY_TV_FORMAT_NONE value."]
    #[doc = "!< In case of NvAPI_DISP_SetDisplayConfig(), this field should only be set in case of TVs;"]
    #[doc = "!< for other displays this field will be ignored and resolution & refresh rate specified in input will be used to apply the TV format."]
    pub tvFormat: NV_DISPLAY_TV_FORMAT,
    #[doc = "!< Ignored if timingOverride == NV_TIMING_OVERRIDE_CURRENT"]
    pub timingOverride: NV_TIMING_OVERRIDE,
    #[doc = "!< Scan out timing, valid only if timingOverride == NV_TIMING_OVERRIDE_CUST"]
    #[doc = "!< The value NV_TIMING::NV_TIMINGEXT::rrx1k is obtained from the EDID. The driver may"]
    #[doc = "!< tweak this value for HDTV, stereo, etc., before reporting it to the OS."]
    pub timing: NV_TIMING,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1() {
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1>(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1)
        )
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_rotation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
                "::",
                stringify!(rotation)
            )
        );
    }
    test_field_rotation();
    fn test_field_scaling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).scaling) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
                "::",
                stringify!(scaling)
            )
        );
    }
    test_field_scaling();
    fn test_field_refreshRate1K() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refreshRate1K) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
                "::",
                stringify!(refreshRate1K)
            )
        );
    }
    test_field_refreshRate1K();
    fn test_field_connector() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).connector) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
                "::",
                stringify!(connector)
            )
        );
    }
    test_field_connector();
    fn test_field_tvFormat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tvFormat) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
                "::",
                stringify!(tvFormat)
            )
        );
    }
    test_field_tvFormat();
    fn test_field_timingOverride() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).timingOverride) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
                "::",
                stringify!(timingOverride)
            )
        );
    }
    test_field_timingOverride();
    fn test_field_timing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).timing) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1),
                "::",
                stringify!(timing)
            )
        );
    }
    test_field_timing();
}
impl Default for _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1 {
    #[inline]
    pub fn interlaced(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_interlaced(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn primary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_primary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reservedBit1(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reservedBit1(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableVirtualModeSupport(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableVirtualModeSupport(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isPreferredUnscaledTarget(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isPreferredUnscaledTarget(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 27u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 27u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        interlaced: NvU32,
        primary: NvU32,
        reservedBit1: NvU32,
        disableVirtualModeSupport: NvU32,
        isPreferredUnscaledTarget: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let interlaced: u32 = unsafe { ::std::mem::transmute(interlaced) };
            interlaced as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let primary: u32 = unsafe { ::std::mem::transmute(primary) };
            primary as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let reservedBit1: u32 = unsafe { ::std::mem::transmute(reservedBit1) };
            reservedBit1 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let disableVirtualModeSupport: u32 =
                unsafe { ::std::mem::transmute(disableVirtualModeSupport) };
            disableVirtualModeSupport as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let isPreferredUnscaledTarget: u32 =
                unsafe { ::std::mem::transmute(isPreferredUnscaledTarget) };
            isPreferredUnscaledTarget as u64
        });
        __bindgen_bitfield_unit.set(5usize, 27u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1 =
    _NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1;
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO = NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO_V1;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1 {
    #[doc = "!< Display ID"]
    pub displayId: NvU32,
    #[doc = "!< May be NULL if no advanced settings are required. NULL for Non-NVIDIA Display."]
    pub details: *mut NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1() {
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1)
        )
    );
    fn test_field_displayId() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).displayId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1),
                "::",
                stringify!(displayId)
            )
        );
    }
    test_field_displayId();
    fn test_field_details() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).details) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1),
                "::",
                stringify!(details)
            )
        );
    }
    test_field_details();
}
impl Default for _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1 = _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2 {
    #[doc = "!< Display ID"]
    pub displayId: NvU32,
    #[doc = "!< May be NULL if no advanced settings are required"]
    pub details: *mut NV_DISPLAYCONFIG_PATH_ADVANCED_TARGET_INFO,
    #[doc = "!< Windows CCD target ID. Must be present only for non-NVIDIA adapter, for NVIDIA adapter this parameter is ignored."]
    pub targetId: NvU32,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2() {
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2)
        )
    );
    fn test_field_displayId() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).displayId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2),
                "::",
                stringify!(displayId)
            )
        );
    }
    test_field_displayId();
    fn test_field_details() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).details) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2),
                "::",
                stringify!(details)
            )
        );
    }
    test_field_details();
    fn test_field_targetId() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).targetId) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2),
                "::",
                stringify!(targetId)
            )
        );
    }
    test_field_targetId();
}
impl Default for _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2 = _NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2;
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_TARGET_INFO = NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2;
pub const _NV_DISPLAYCONFIG_SPANNING_ORIENTATION_NV_DISPLAYCONFIG_SPAN_NONE:
    _NV_DISPLAYCONFIG_SPANNING_ORIENTATION = 0;
pub const _NV_DISPLAYCONFIG_SPANNING_ORIENTATION_NV_DISPLAYCONFIG_SPAN_HORIZONTAL:
    _NV_DISPLAYCONFIG_SPANNING_ORIENTATION = 1;
pub const _NV_DISPLAYCONFIG_SPANNING_ORIENTATION_NV_DISPLAYCONFIG_SPAN_VERTICAL:
    _NV_DISPLAYCONFIG_SPANNING_ORIENTATION = 2;
#[doc = "! \\ingroup dispcontrol"]
pub type _NV_DISPLAYCONFIG_SPANNING_ORIENTATION = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
pub use self::_NV_DISPLAYCONFIG_SPANNING_ORIENTATION as NV_DISPLAYCONFIG_SPANNING_ORIENTATION;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1 {
    pub resolution: NV_RESOLUTION,
    #[doc = "!< Ignored at present, must be NV_FORMAT_UNKNOWN (0)"]
    pub colorFormat: NV_FORMAT,
    #[doc = "!< Is all positions are 0 or invalid, displays will be automatically"]
    #[doc = "!< positioned from left to right with GDI Primary at 0,0, and all"]
    #[doc = "!< other displays in the order of the path array."]
    pub position: NV_POSITION,
    #[doc = "!< Spanning is only supported on XP"]
    pub spanningOrientation: NV_DISPLAYCONFIG_SPANNING_ORIENTATION,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1() {
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1)
        )
    );
    fn test_field_resolution() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).resolution) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1),
                "::",
                stringify!(resolution)
            )
        );
    }
    test_field_resolution();
    fn test_field_colorFormat() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).colorFormat) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1),
                "::",
                stringify!(colorFormat)
            )
        );
    }
    test_field_colorFormat();
    fn test_field_position() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1),
                "::",
                stringify!(position)
            )
        );
    }
    test_field_position();
    fn test_field_spanningOrientation() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spanningOrientation) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1),
                "::",
                stringify!(spanningOrientation)
            )
        );
    }
    test_field_spanningOrientation();
}
impl Default for _NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1 {
    #[inline]
    pub fn bGDIPrimary(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bGDIPrimary(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bSLIFocus(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bSLIFocus(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bGDIPrimary: NvU32,
        bSLIFocus: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bGDIPrimary: u32 = unsafe { ::std::mem::transmute(bGDIPrimary) };
            bGDIPrimary as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bSLIFocus: u32 = unsafe { ::std::mem::transmute(bSLIFocus) };
            bSLIFocus as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1 = _NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1;
#[doc = "! \\ingroup dispcontrol"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_INFO_V1 {
    pub version: NvU32,
    #[doc = "!< This field is reserved. There is ongoing debate if we need this field."]
    #[doc = "!< Identifies sourceIds used by Windows. If all sourceIds are 0,"]
    #[doc = "!< these will be computed automatically."]
    pub reserved_sourceId: NvU32,
    #[doc = "!< Number of elements in targetInfo array"]
    pub targetInfoCount: NvU32,
    pub targetInfo: *mut NV_DISPLAYCONFIG_PATH_TARGET_INFO_V1,
    #[doc = "!< May be NULL if mode info is not important"]
    pub sourceModeInfo: *mut NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_INFO_V1() {
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_INFO_V1>(),
        32usize,
        concat!("Size of: ", stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_INFO_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_reserved_sourceId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved_sourceId) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
                "::",
                stringify!(reserved_sourceId)
            )
        );
    }
    test_field_reserved_sourceId();
    fn test_field_targetInfoCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).targetInfoCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
                "::",
                stringify!(targetInfoCount)
            )
        );
    }
    test_field_targetInfoCount();
    fn test_field_targetInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).targetInfo) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
                "::",
                stringify!(targetInfo)
            )
        );
    }
    test_field_targetInfo();
    fn test_field_sourceModeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sourceModeInfo) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO_V1),
                "::",
                stringify!(sourceModeInfo)
            )
        );
    }
    test_field_sourceModeInfo();
}
impl Default for _NV_DISPLAYCONFIG_PATH_INFO_V1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_INFO_V1 = _NV_DISPLAYCONFIG_PATH_INFO_V1;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NV_DISPLAYCONFIG_PATH_INFO {
    pub version: NvU32,
    pub __bindgen_anon_1: _NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1,
    #[doc = "!< Number of elements in targetInfo array"]
    pub targetInfoCount: NvU32,
    pub targetInfo: *mut NV_DISPLAYCONFIG_PATH_TARGET_INFO_V2,
    #[doc = "!< May be NULL if mode info is not important"]
    pub sourceModeInfo: *mut NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "!< Used by Non-NVIDIA adapter for pointer to OS Adapter of LUID"]
    #[doc = "!< type, type casted to void *."]
    pub pOSAdapterID: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1 {
    #[doc = "!< Identifies sourceId used by Windows CCD. This can be optionally set."]
    pub sourceId: NvU32,
    #[doc = "!< Only for compatibility"]
    pub reserved_sourceId: NvU32,
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1)
        )
    );
    fn test_field_sourceId() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sourceId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1),
                "::",
                stringify!(sourceId)
            )
        );
    }
    test_field_sourceId();
    fn test_field_reserved_sourceId() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved_sourceId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1),
                "::",
                stringify!(reserved_sourceId)
            )
        );
    }
    test_field_reserved_sourceId();
}
impl Default for _NV_DISPLAYCONFIG_PATH_INFO__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__NV_DISPLAYCONFIG_PATH_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_NV_DISPLAYCONFIG_PATH_INFO>(),
        48usize,
        concat!("Size of: ", stringify!(_NV_DISPLAYCONFIG_PATH_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_DISPLAYCONFIG_PATH_INFO>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_DISPLAYCONFIG_PATH_INFO))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_targetInfoCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).targetInfoCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
                "::",
                stringify!(targetInfoCount)
            )
        );
    }
    test_field_targetInfoCount();
    fn test_field_targetInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).targetInfo) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
                "::",
                stringify!(targetInfo)
            )
        );
    }
    test_field_targetInfo();
    fn test_field_sourceModeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sourceModeInfo) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
                "::",
                stringify!(sourceModeInfo)
            )
        );
    }
    test_field_sourceModeInfo();
    fn test_field_pOSAdapterID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_DISPLAYCONFIG_PATH_INFO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pOSAdapterID) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_DISPLAYCONFIG_PATH_INFO),
                "::",
                stringify!(pOSAdapterID)
            )
        );
    }
    test_field_pOSAdapterID();
}
impl Default for _NV_DISPLAYCONFIG_PATH_INFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_DISPLAYCONFIG_PATH_INFO {
    #[inline]
    pub fn IsNonNVIDIAAdapter(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_IsNonNVIDIAAdapter(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        IsNonNVIDIAAdapter: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let IsNonNVIDIAAdapter: u32 = unsafe { ::std::mem::transmute(IsNonNVIDIAAdapter) };
            IsNonNVIDIAAdapter as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_PATH_INFO_V2 = _NV_DISPLAYCONFIG_PATH_INFO;
pub type NV_DISPLAYCONFIG_PATH_INFO = NV_DISPLAYCONFIG_PATH_INFO_V2;
#[doc = "! \\ingroup dispcontrol"]
pub type NV_DISPLAYCONFIG_SOURCE_MODE_INFO = NV_DISPLAYCONFIG_SOURCE_MODE_INFO_V1;
pub const _NV_DISPLAYCONFIG_FLAGS_NV_DISPLAYCONFIG_VALIDATE_ONLY: _NV_DISPLAYCONFIG_FLAGS = 1;
pub const _NV_DISPLAYCONFIG_FLAGS_NV_DISPLAYCONFIG_SAVE_TO_PERSISTENCE: _NV_DISPLAYCONFIG_FLAGS = 2;
#[doc = "!< Driver reload is permitted if necessary"]
pub const _NV_DISPLAYCONFIG_FLAGS_NV_DISPLAYCONFIG_DRIVER_RELOAD_ALLOWED: _NV_DISPLAYCONFIG_FLAGS =
    4;
#[doc = "!< Refresh OS mode list."]
pub const _NV_DISPLAYCONFIG_FLAGS_NV_DISPLAYCONFIG_FORCE_MODE_ENUMERATION: _NV_DISPLAYCONFIG_FLAGS =
    8;
#[doc = "!< Tell OS to avoid optimizing CommitVidPn call during a modeset"]
pub const _NV_DISPLAYCONFIG_FLAGS_NV_FORCE_COMMIT_VIDPN: _NV_DISPLAYCONFIG_FLAGS = 16;
#[doc = "! \\ingroup dispcontrol"]
pub type _NV_DISPLAYCONFIG_FLAGS = ::std::os::raw::c_int;
#[doc = "! \\ingroup dispcontrol"]
pub use self::_NV_DISPLAYCONFIG_FLAGS as NV_DISPLAYCONFIG_FLAGS;
pub type NvAPI_UnicodeString = [NvU16; 2048usize];
pub type NvAPI_LPCWSTR = *const NvU16;
pub const _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID_NVAPI_GPU_PERF_VOLTAGE_INFO_DOMAIN_CORE:
    _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID = 0;
pub const _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID_NVAPI_GPU_PERF_VOLTAGE_INFO_DOMAIN_UNDEFINED:
    _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID = 16;
#[doc = "! \\ingroup gpuclock"]
pub type _NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpuclock"]
pub use self::_NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID as NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_GRAPHICS: _NV_GPU_PUBLIC_CLOCK_ID = 0;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_MEMORY: _NV_GPU_PUBLIC_CLOCK_ID = 4;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_PROCESSOR: _NV_GPU_PUBLIC_CLOCK_ID = 7;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_VIDEO: _NV_GPU_PUBLIC_CLOCK_ID = 8;
pub const _NV_GPU_PUBLIC_CLOCK_ID_NVAPI_GPU_PUBLIC_CLOCK_UNDEFINED: _NV_GPU_PUBLIC_CLOCK_ID = 32;
#[doc = "! \\ingroup gpuclock"]
pub type _NV_GPU_PUBLIC_CLOCK_ID = ::std::os::raw::c_int;
#[doc = "! \\ingroup gpuclock"]
pub use self::_NV_GPU_PUBLIC_CLOCK_ID as NV_GPU_PUBLIC_CLOCK_ID;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P0: _NV_GPU_PERF_PSTATE_ID = 0;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P1: _NV_GPU_PERF_PSTATE_ID = 1;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P2: _NV_GPU_PERF_PSTATE_ID = 2;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P3: _NV_GPU_PERF_PSTATE_ID = 3;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P4: _NV_GPU_PERF_PSTATE_ID = 4;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P5: _NV_GPU_PERF_PSTATE_ID = 5;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P6: _NV_GPU_PERF_PSTATE_ID = 6;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P7: _NV_GPU_PERF_PSTATE_ID = 7;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P8: _NV_GPU_PERF_PSTATE_ID = 8;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P9: _NV_GPU_PERF_PSTATE_ID = 9;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P10: _NV_GPU_PERF_PSTATE_ID = 10;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P11: _NV_GPU_PERF_PSTATE_ID = 11;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P12: _NV_GPU_PERF_PSTATE_ID = 12;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P13: _NV_GPU_PERF_PSTATE_ID = 13;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P14: _NV_GPU_PERF_PSTATE_ID = 14;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_P15: _NV_GPU_PERF_PSTATE_ID = 15;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_UNDEFINED: _NV_GPU_PERF_PSTATE_ID = 16;
pub const _NV_GPU_PERF_PSTATE_ID_NVAPI_GPU_PERF_PSTATE_ALL: _NV_GPU_PERF_PSTATE_ID = 17;
#[doc = "! \\addtogroup gpupstate"]
#[doc = "! @{"]
pub type _NV_GPU_PERF_PSTATE_ID = ::std::os::raw::c_int;
#[doc = "! \\addtogroup gpupstate"]
#[doc = "! @{"]
pub use self::_NV_GPU_PERF_PSTATE_ID as NV_GPU_PERF_PSTATE_ID;
#[doc = "! Clock domains that use single frequency value within given pstate"]
pub const NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID_NVAPI_GPU_PERF_PSTATE20_CLOCK_TYPE_SINGLE:
    NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID = 0;
#[doc = "! Clock domains that allow range of frequency values within given pstate"]
pub const NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID_NVAPI_GPU_PERF_PSTATE20_CLOCK_TYPE_RANGE:
    NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID = 1;
#[doc = "! Used to identify clock type"]
pub type NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID = ::std::os::raw::c_int;
#[doc = "! Used to describe both voltage and frequency deltas"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_GPU_PERF_PSTATES20_PARAM_DELTA {
    #[doc = "! Value of parameter delta (in respective units [kHz, uV])"]
    pub value: NvS32,
    pub valueRange: NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1 {
    #[doc = "! Min value allowed for parameter delta (in respective units [kHz, uV])"]
    pub min: NvS32,
    #[doc = "! Max value allowed for parameter delta (in respective units [kHz, uV])"]
    pub max: NvS32,
}
#[test]
fn bindgen_test_layout_NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1)
        )
    );
    fn test_field_min() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1),
                "::",
                stringify!(min)
            )
        );
    }
    test_field_min();
    fn test_field_max() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA__bindgen_ty_1),
                "::",
                stringify!(max)
            )
        );
    }
    test_field_max();
}
#[test]
fn bindgen_test_layout_NV_GPU_PERF_PSTATES20_PARAM_DELTA() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PERF_PSTATES20_PARAM_DELTA>(),
        12usize,
        concat!("Size of: ", stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PERF_PSTATES20_PARAM_DELTA>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA)
        )
    );
    fn test_field_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_PARAM_DELTA>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA),
                "::",
                stringify!(value)
            )
        );
    }
    test_field_value();
    fn test_field_valueRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_PARAM_DELTA>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).valueRange) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_PARAM_DELTA),
                "::",
                stringify!(valueRange)
            )
        );
    }
    test_field_valueRange();
}
#[doc = "! Used to describe single clock entry"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NV_GPU_PSTATE20_CLOCK_ENTRY_V1 {
    #[doc = "! ID of the clock domain"]
    pub domainId: NV_GPU_PUBLIC_CLOCK_ID,
    #[doc = "! Clock type ID"]
    pub typeId: NV_GPU_PERF_PSTATE20_CLOCK_TYPE_ID,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Current frequency delta from nominal settings in (kHz)"]
    pub freqDelta_kHz: NV_GPU_PERF_PSTATES20_PARAM_DELTA,
    pub data: NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1,
}
#[doc = "! Clock domain type dependant information"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1 {
    pub single: NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1,
    pub range: NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "! Clock frequency within given pstate in (kHz)"]
    pub freq_kHz: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_freq_kHz() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).freq_kHz) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(freq_kHz)
            )
        );
    }
    test_field_freq_kHz();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "! Min clock frequency within given pstate in (kHz)"]
    pub minFreq_kHz: NvU32,
    #[doc = "! Max clock frequency within given pstate in (kHz)"]
    pub maxFreq_kHz: NvU32,
    #[doc = "! Voltage domain ID and value range in (uV) required for this clock"]
    pub domainId: NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID,
    pub minVoltage_uV: NvU32,
    pub maxVoltage_uV: NvU32,
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2>(),
        20usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2)
        )
    );
    fn test_field_minFreq_kHz() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minFreq_kHz) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(minFreq_kHz)
            )
        );
    }
    test_field_minFreq_kHz();
    fn test_field_maxFreq_kHz() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxFreq_kHz) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(maxFreq_kHz)
            )
        );
    }
    test_field_maxFreq_kHz();
    fn test_field_domainId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).domainId) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(domainId)
            )
        );
    }
    test_field_domainId();
    fn test_field_minVoltage_uV() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minVoltage_uV) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(minVoltage_uV)
            )
        );
    }
    test_field_minVoltage_uV();
    fn test_field_maxVoltage_uV() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxVoltage_uV) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(maxVoltage_uV)
            )
        );
    }
    test_field_maxVoltage_uV();
}
impl Default for NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1>(),
        20usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1)
        )
    );
    fn test_field_single() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).single) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1),
                "::",
                stringify!(single)
            )
        );
    }
    test_field_single();
    fn test_field_range() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1),
                "::",
                stringify!(range)
            )
        );
    }
    test_field_range();
}
impl Default for NV_GPU_PSTATE20_CLOCK_ENTRY_V1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_CLOCK_ENTRY_V1() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1>(),
        44usize,
        concat!("Size of: ", stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1))
    );
    fn test_field_domainId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).domainId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1),
                "::",
                stringify!(domainId)
            )
        );
    }
    test_field_domainId();
    fn test_field_typeId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).typeId) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1),
                "::",
                stringify!(typeId)
            )
        );
    }
    test_field_typeId();
    fn test_field_freqDelta_kHz() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).freqDelta_kHz) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1),
                "::",
                stringify!(freqDelta_kHz)
            )
        );
    }
    test_field_freqDelta_kHz();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_CLOCK_ENTRY_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_CLOCK_ENTRY_V1),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
impl Default for NV_GPU_PSTATE20_CLOCK_ENTRY_V1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl NV_GPU_PSTATE20_CLOCK_ENTRY_V1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! Used to describe single base voltage entry"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1 {
    #[doc = "! ID of the voltage domain"]
    pub domainId: NV_GPU_PERF_VOLTAGE_INFO_DOMAIN_ID,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Current base voltage settings in [uV]"]
    pub volt_uV: NvU32,
    pub voltDelta_uV: NV_GPU_PERF_PSTATES20_PARAM_DELTA,
}
#[test]
fn bindgen_test_layout_NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1)
        )
    );
    fn test_field_domainId() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).domainId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1),
                "::",
                stringify!(domainId)
            )
        );
    }
    test_field_domainId();
    fn test_field_volt_uV() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).volt_uV) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1),
                "::",
                stringify!(volt_uV)
            )
        );
    }
    test_field_volt_uV();
    fn test_field_voltDelta_uV() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).voltDelta_uV) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1),
                "::",
                stringify!(voltDelta_uV)
            )
        );
    }
    test_field_voltDelta_uV();
}
impl Default for NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! Used in NvAPI_GPU_GetPstates20() interface call."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NV_GPU_PERF_PSTATES20_INFO_V1 {
    #[doc = "! Version info of the structure (NV_GPU_PERF_PSTATES20_INFO_VER<n>)"]
    pub version: NvU32,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Number of populated pstates"]
    pub numPstates: NvU32,
    #[doc = "! Number of populated clocks (per pstate)"]
    pub numClocks: NvU32,
    #[doc = "! Number of populated base voltages (per pstate)"]
    pub numBaseVoltages: NvU32,
    pub pstates: [NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1; 16usize],
}
#[doc = "! Performance state (P-State) settings"]
#[doc = "! Valid index range is 0 to numPstates-1"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1 {
    #[doc = "! ID of the P-State"]
    pub pstateId: NV_GPU_PERF_PSTATE_ID,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Array of clock entries"]
    #[doc = "! Valid index range is 0 to numClocks-1"]
    pub clocks: [NV_GPU_PSTATE20_CLOCK_ENTRY_V1; 8usize],
    #[doc = "! Array of baseVoltage entries"]
    #[doc = "! Valid index range is 0 to numBaseVoltages-1"]
    pub baseVoltages: [NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1; 4usize],
}
#[test]
fn bindgen_test_layout_NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1>(),
        456usize,
        concat!(
            "Size of: ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1)
        )
    );
    fn test_field_pstateId() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pstateId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1),
                "::",
                stringify!(pstateId)
            )
        );
    }
    test_field_pstateId();
    fn test_field_clocks() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).clocks) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1),
                "::",
                stringify!(clocks)
            )
        );
    }
    test_field_clocks();
    fn test_field_baseVoltages() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baseVoltages) as usize - ptr as usize
            },
            360usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1),
                "::",
                stringify!(baseVoltages)
            )
        );
    }
    test_field_baseVoltages();
}
impl Default for NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl NV_GPU_PERF_PSTATES20_INFO_V1__bindgen_ty_1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_NV_GPU_PERF_PSTATES20_INFO_V1() {
    assert_eq!(
        ::std::mem::size_of::<NV_GPU_PERF_PSTATES20_INFO_V1>(),
        7316usize,
        concat!("Size of: ", stringify!(NV_GPU_PERF_PSTATES20_INFO_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_GPU_PERF_PSTATES20_INFO_V1>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_GPU_PERF_PSTATES20_INFO_V1))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_numPstates() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numPstates) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
                "::",
                stringify!(numPstates)
            )
        );
    }
    test_field_numPstates();
    fn test_field_numClocks() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numClocks) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
                "::",
                stringify!(numClocks)
            )
        );
    }
    test_field_numClocks();
    fn test_field_numBaseVoltages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numBaseVoltages) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
                "::",
                stringify!(numBaseVoltages)
            )
        );
    }
    test_field_numBaseVoltages();
    fn test_field_pstates() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_GPU_PERF_PSTATES20_INFO_V1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pstates) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_GPU_PERF_PSTATES20_INFO_V1),
                "::",
                stringify!(pstates)
            )
        );
    }
    test_field_pstates();
}
impl Default for NV_GPU_PERF_PSTATES20_INFO_V1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl NV_GPU_PERF_PSTATES20_INFO_V1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! Used in NvAPI_GPU_GetPstates20() interface call."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NV_GPU_PERF_PSTATES20_INFO_V2 {
    #[doc = "! Version info of the structure (NV_GPU_PERF_PSTATES20_INFO_VER<n>)"]
    pub version: NvU32,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Number of populated pstates"]
    pub numPstates: NvU32,
    #[doc = "! Number of populated clocks (per pstate)"]
    pub numClocks: NvU32,
    #[doc = "! Number of populated base voltages (per pstate)"]
    pub numBaseVoltages: NvU32,
    pub pstates: [_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1; 16usize],
    pub ov: _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2,
}
#[doc = "! Performance state (P-State) settings"]
#[doc = "! Valid index range is 0 to numPstates-1"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1 {
    #[doc = "! ID of the P-State"]
    pub pstateId: NV_GPU_PERF_PSTATE_ID,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "! Array of clock entries"]
    #[doc = "! Valid index range is 0 to numClocks-1"]
    pub clocks: [NV_GPU_PSTATE20_CLOCK_ENTRY_V1; 8usize],
    #[doc = "! Array of baseVoltage entries"]
    #[doc = "! Valid index range is 0 to numBaseVoltages-1"]
    pub baseVoltages: [NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1; 4usize],
}
#[test]
fn bindgen_test_layout__NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1>(),
        456usize,
        concat!(
            "Size of: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1)
        )
    );
    fn test_field_pstateId() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pstateId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1),
                "::",
                stringify!(pstateId)
            )
        );
    }
    test_field_pstateId();
    fn test_field_clocks() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).clocks) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1),
                "::",
                stringify!(clocks)
            )
        );
    }
    test_field_clocks();
    fn test_field_baseVoltages() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baseVoltages) as usize - ptr as usize
            },
            360usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1),
                "::",
                stringify!(baseVoltages)
            )
        );
    }
    test_field_baseVoltages();
}
impl Default for _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_1 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! OV settings - Please refer to NVIDIA over-volting recommendation to understand impact of this functionality"]
#[doc = "! Valid index range is 0 to numVoltages-1"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2 {
    #[doc = "! Number of populated voltages"]
    pub numVoltages: NvU32,
    #[doc = "! Array of voltage entries"]
    #[doc = "! Valid index range is 0 to numVoltages-1"]
    pub voltages: [NV_GPU_PSTATE20_BASE_VOLTAGE_ENTRY_V1; 4usize],
}
#[test]
fn bindgen_test_layout__NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2>(),
        100usize,
        concat!(
            "Size of: ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2)
        )
    );
    fn test_field_numVoltages() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numVoltages) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2),
                "::",
                stringify!(numVoltages)
            )
        );
    }
    test_field_numVoltages();
    fn test_field_voltages() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).voltages) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2),
                "::",
                stringify!(voltages)
            )
        );
    }
    test_field_voltages();
}
impl Default for _NV_GPU_PERF_PSTATES20_INFO_V2__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__NV_GPU_PERF_PSTATES20_INFO_V2() {
    assert_eq!(
        ::std::mem::size_of::<_NV_GPU_PERF_PSTATES20_INFO_V2>(),
        7416usize,
        concat!("Size of: ", stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_GPU_PERF_PSTATES20_INFO_V2>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_numPstates() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numPstates) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
                "::",
                stringify!(numPstates)
            )
        );
    }
    test_field_numPstates();
    fn test_field_numClocks() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numClocks) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
                "::",
                stringify!(numClocks)
            )
        );
    }
    test_field_numClocks();
    fn test_field_numBaseVoltages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).numBaseVoltages) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
                "::",
                stringify!(numBaseVoltages)
            )
        );
    }
    test_field_numBaseVoltages();
    fn test_field_pstates() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pstates) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
                "::",
                stringify!(pstates)
            )
        );
    }
    test_field_pstates();
    fn test_field_ov() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_NV_GPU_PERF_PSTATES20_INFO_V2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ov) as usize - ptr as usize
            },
            7316usize,
            concat!(
                "Offset of field: ",
                stringify!(_NV_GPU_PERF_PSTATES20_INFO_V2),
                "::",
                stringify!(ov)
            )
        );
    }
    test_field_ov();
}
impl Default for _NV_GPU_PERF_PSTATES20_INFO_V2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_GPU_PERF_PSTATES20_INFO_V2 {
    #[inline]
    pub fn bIsEditable(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bIsEditable(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> NvU32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: NvU32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bIsEditable: NvU32,
        reserved: NvU32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bIsEditable: u32 = unsafe { ::std::mem::transmute(bIsEditable) };
            bIsEditable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "! Used in NvAPI_GPU_GetPstates20() interface call."]
pub type NV_GPU_PERF_PSTATES20_INFO_V2 = _NV_GPU_PERF_PSTATES20_INFO_V2;
#[doc = "! Used in NvAPI_GPU_GetPstates20() interface call."]
pub type NV_GPU_PERF_PSTATES20_INFO = NV_GPU_PERF_PSTATES20_INFO_V2;
#[doc = "! \\ingroup driverapi"]
#[doc = "! Used in NvAPI_GetDisplayDriverVersion()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NV_DISPLAY_DRIVER_VERSION {
    pub version: NvU32,
    pub drvVersion: NvU32,
    pub bldChangeListNum: NvU32,
    pub szBuildBranchString: NvAPI_ShortString,
    pub szAdapterString: NvAPI_ShortString,
}
#[test]
fn bindgen_test_layout_NV_DISPLAY_DRIVER_VERSION() {
    assert_eq!(
        ::std::mem::size_of::<NV_DISPLAY_DRIVER_VERSION>(),
        140usize,
        concat!("Size of: ", stringify!(NV_DISPLAY_DRIVER_VERSION))
    );
    assert_eq!(
        ::std::mem::align_of::<NV_DISPLAY_DRIVER_VERSION>(),
        4usize,
        concat!("Alignment of ", stringify!(NV_DISPLAY_DRIVER_VERSION))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_VERSION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_VERSION),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_drvVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_VERSION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).drvVersion) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_VERSION),
                "::",
                stringify!(drvVersion)
            )
        );
    }
    test_field_drvVersion();
    fn test_field_bldChangeListNum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_VERSION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bldChangeListNum) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_VERSION),
                "::",
                stringify!(bldChangeListNum)
            )
        );
    }
    test_field_bldChangeListNum();
    fn test_field_szBuildBranchString() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_VERSION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).szBuildBranchString) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_VERSION),
                "::",
                stringify!(szBuildBranchString)
            )
        );
    }
    test_field_szBuildBranchString();
    fn test_field_szAdapterString() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NV_DISPLAY_DRIVER_VERSION>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).szAdapterString) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(NV_DISPLAY_DRIVER_VERSION),
                "::",
                stringify!(szAdapterString)
            )
        );
    }
    test_field_szAdapterString();
}
impl Default for NV_DISPLAY_DRIVER_VERSION {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    #[doc = "! \\ingroup driverapi"]
    pub fn NvAPI_GetDisplayDriverVersion(
        hNvDisplay: NvDisplayHandle,
        pVersion: *mut NV_DISPLAY_DRIVER_VERSION,
    ) -> NvAPI_Status;
}
#[doc = "!   DESCRIPTION: Used in conjunction with OUTPUT_TO_CALLBACK, this is a simple"]
#[doc = "!                callback function the user may use to obtain the feedback"]
#[doc = "!                stream. The function will be called once per fully qualified"]
#[doc = "!                feedback stream entry."]
#[doc = "!"]
#[doc = "!   \\param   categoryId    Contains the bit from the NVAPI_OGLEXPERT_REPORT"]
#[doc = "!                          mask that corresponds to the current message"]
#[doc = "!   \\param   messageId     Unique ID for the current message"]
#[doc = "!   \\param   detailLevel   Contains the bit from the NVAPI_OGLEXPERT_DETAIL"]
#[doc = "!                          mask that corresponds to the current message"]
#[doc = "!   \\param   objectId      Unique ID of the object that corresponds to the"]
#[doc = "!                          current message"]
#[doc = "!   \\param   messageStr    Text string from the current message"]
#[doc = "!"]
#[doc = "!   \\ingroup oglapi"]
#[doc = ""]
pub type NVAPI_OGLEXPERT_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        categoryId: ::std::os::raw::c_uint,
        messageId: ::std::os::raw::c_uint,
        detailLevel: ::std::os::raw::c_uint,
        objectId: ::std::os::raw::c_int,
        messageStr: *const ::std::os::raw::c_char,
    ),
>;
extern "C" {
    #[doc = "! \\ingroup oglapi"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    pub fn NvAPI_OGL_ExpertModeSet(
        expertDetailLevel: NvU32,
        expertReportMask: NvU32,
        expertOutputMask: NvU32,
        expertCallback: NVAPI_OGLEXPERT_CALLBACK,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\addtogroup oglapi"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    pub fn NvAPI_OGL_ExpertModeGet(
        pExpertDetailLevel: *mut NvU32,
        pExpertReportMask: *mut NvU32,
        pExpertOutputMask: *mut NvU32,
        pExpertCallback: *mut NVAPI_OGLEXPERT_CALLBACK,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\ingroup oglapi"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    pub fn NvAPI_OGL_ExpertModeDefaultsSet(
        expertDetailLevel: NvU32,
        expertReportMask: NvU32,
        expertOutputMask: NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! \\addtogroup oglapi"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    pub fn NvAPI_OGL_ExpertModeDefaultsGet(
        pExpertDetailLevel: *mut NvU32,
        pExpertReportMask: *mut NvU32,
        pExpertOutputMask: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns an array of physical GPU handles that are in TCC Mode."]
    #[doc = "! Each handle represents a physical GPU present in the system in TCC Mode."]
    #[doc = "! That GPU may not be visible to the OS directly."]
    #[doc = "!"]
    #[doc = "! The array nvGPUHandle will be filled with physical GPU handle values. The returned"]
    #[doc = "! gpuCount determines how many entries in the array are valid."]
    #[doc = "!"]
    #[doc = "! NOTE: Handles enumerated by this API are only valid for NvAPIs that are tagged as TCC_SUPPORTED"]
    #[doc = "!       If handle is passed to any other API, it will fail with NVAPI_INVALID_HANDLE"]
    #[doc = "!"]
    #[doc = "!       For WDDM GPU handles please use NvAPI_EnumPhysicalGPUs()"]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\param [out]   nvGPUHandle      Physical GPU array that will contain all TCC Physical GPUs"]
    #[doc = "! \\param [out]   pGpuCount        count represent the number of valid entries in nvGPUHandle"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\retval NVAPI_INVALID_ARGUMENT         nvGPUHandle or pGpuCount is NULL"]
    #[doc = "! \\ingroup gpu"]
    #[doc = ""]
    pub fn NvAPI_EnumTCCPhysicalGPUs(
        nvGPUHandle: *mut NvPhysicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns an array of logical GPU handles."]
    #[doc = "!"]
    #[doc = "! Each handle represents one or more GPUs acting in concert as a single graphics device."]
    #[doc = "!"]
    #[doc = "! At least one GPU must be present in the system and running an NVIDIA display driver."]
    #[doc = "!"]
    #[doc = "! The array nvGPUHandle will be filled with logical GPU handle values.  The returned"]
    #[doc = "! gpuCount determines how many entries in the array are valid."]
    #[doc = "!"]
    #[doc = "! \\note All logical GPUs handles get invalidated on a GPU topology change, so the calling"]
    #[doc = "!       application is required to renum the logical GPU handles to get latest physical handle"]
    #[doc = "!       mapping after every GPU topology change activated by a call to NvAPI_SetGpuTopologies()."]
    #[doc = "!"]
    #[doc = "! To detect if SLI rendering is enabled, use NvAPI_D3D_GetCurrentSLIState()."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\retval NVAPI_INVALID_ARGUMENT         nvGPUHandle or pGpuCount is NULL"]
    #[doc = "! \\retval NVAPI_OK                       One or more handles were returned"]
    #[doc = "! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found"]
    #[doc = "! \\ingroup gpu"]
    #[doc = ""]
    pub fn NvAPI_EnumLogicalGPUs(
        nvGPUHandle: *mut NvLogicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns an array of physical GPU handles associated with the specified display."]
    #[doc = "!"]
    #[doc = "! At least one GPU must be present in the system and running an NVIDIA display driver."]
    #[doc = "!"]
    #[doc = "! The array nvGPUHandle will be filled with physical GPU handle values.  The returned"]
    #[doc = "! gpuCount determines how many entries in the array are valid."]
    #[doc = "!"]
    #[doc = "! If the display corresponds to more than one physical GPU, the first GPU returned"]
    #[doc = "! is the one with the attached active output."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\retval NVAPI_INVALID_ARGUMENT         hNvDisp is not valid; nvGPUHandle or pGpuCount is NULL"]
    #[doc = "! \\retval NVAPI_OK                       One or more handles were returned"]
    #[doc = "! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  no NVIDIA GPU driving a display was found"]
    #[doc = "! \\ingroup gpu"]
    #[doc = ""]
    pub fn NvAPI_GetPhysicalGPUsFromDisplay(
        hNvDisp: NvDisplayHandle,
        nvGPUHandle: *mut NvPhysicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns a physical GPU handle associated with the specified unattached display."]
    #[doc = "! The source GPU is a physical render GPU which renders the frame buffer but may or may not drive the scan out."]
    #[doc = "!"]
    #[doc = "! At least one GPU must be present in the system and running an NVIDIA display driver."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\retval NVAPI_INVALID_ARGUMENT         hNvUnAttachedDisp is not valid or pPhysicalGpu is NULL."]
    #[doc = "! \\retval NVAPI_OK                       One or more handles were returned"]
    #[doc = "! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found"]
    #[doc = "! \\ingroup gpu"]
    #[doc = ""]
    pub fn NvAPI_GetPhysicalGPUFromUnAttachedDisplay(
        hNvUnAttachedDisp: NvUnAttachedDisplayHandle,
        pPhysicalGpu: *mut NvPhysicalGpuHandle,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns the logical GPU handle associated with the specified display."]
    #[doc = "! At least one GPU must be present in the system and running an NVIDIA display driver."]
    #[doc = "! hNvDisp can be NVAPI_DEFAULT_HANDLE or a handle enumerated from NvAPI_EnumNVidiaDisplayHandle()."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\retval NVAPI_INVALID_ARGUMENT         hNvDisp is not valid; pLogicalGPU is NULL"]
    #[doc = "! \\retval NVAPI_OK                       One or more handles were returned"]
    #[doc = "! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found"]
    #[doc = "! \\ingroup gpu"]
    #[doc = ""]
    pub fn NvAPI_GetLogicalGPUFromDisplay(
        hNvDisp: NvDisplayHandle,
        pLogicalGPU: *mut NvLogicalGpuHandle,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "! This function returns the logical GPU handle associated with specified physical GPU handle."]
    #[doc = "! At least one GPU must be present in the system and running an NVIDIA display driver."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\retval NVAPI_INVALID_ARGUMENT         hPhysicalGPU is not valid; pLogicalGPU is NULL"]
    #[doc = "! \\retval NVAPI_OK                       One or more handles were returned"]
    #[doc = "! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND  No NVIDIA GPU driving a display was found"]
    #[doc = "! \\ingroup gpu"]
    #[doc = ""]
    pub fn NvAPI_GetLogicalGPUFromPhysicalGPU(
        hPhysicalGPU: NvPhysicalGpuHandle,
        pLogicalGPU: *mut NvLogicalGpuHandle,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  This function returns the physical GPU handles associated with the specified logical GPU handle."]
    #[doc = "!  At least one GPU must be present in the system and running an NVIDIA display driver."]
    #[doc = "!"]
    #[doc = "!  The array hPhysicalGPU will be filled with physical GPU handle values.  The returned"]
    #[doc = "!  gpuCount determines how many entries in the array are valid."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 7 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
    #[doc = "! \\retval NVAPI_INVALID_ARGUMENT             hLogicalGPU is not valid; hPhysicalGPU is NULL"]
    #[doc = "! \\retval NVAPI_OK                           One or more handles were returned"]
    #[doc = "! \\retval NVAPI_NVIDIA_DEVICE_NOT_FOUND      No NVIDIA GPU driving a display was found"]
    #[doc = "! \\retval NVAPI_EXPECTED_LOGICAL_GPU_HANDLE  hLogicalGPU was not a logical GPU handle"]
    #[doc = "! \\ingroup gpu"]
    #[doc = ""]
    pub fn NvAPI_GetPhysicalGPUsFromLogicalGPU(
        hLogicalGPU: NvLogicalGpuHandle,
        hPhysicalGPU: *mut NvPhysicalGpuHandle,
        pGpuCount: *mut NvU32,
    ) -> NvAPI_Status;
}
extern "C" {
    #[doc = "!  Do not use this function for new software development."]
    #[doc = "!"]
    #[doc = "! SUPPORTED OS:  Windows 10 and higher"]
    #[doc = "!"]
    #[doc = "!"]
    #[doc = "! TCC_SUPPORTED"]
    #[doc = "!"]
    #[doc = "! \\since Release: 80"]
    #[doc = "!"]
